<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>add connfact clientid</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Ajouter Objet Classe de connexion &gt; <BR>Identification du client</H2>
 
<P>Utilisez cet onglet pour sp&eacute;cifier les valeurs par d&eacute;faut du nom utilisateur et du mot de passe ainsi que le mode d'identification du client (ClientID) sur un courtier. Les valeurs ClientId servent essentiellement &agrave; suivre les abonn&eacute;s durables.</P>

<P><b>Nom d'utilisateur par d&eacute;faut</b> Sp&eacute;cifie le nom d'utilisateur par d&eacute;faut qui sera utilis&eacute; pour l'authentification par le courtier. La valeur par d&eacute;faut est <code>guest</code>.</P>
<p><b>Mot de passe par d&eacute;faut</b> Sp&eacute;cifie le mot de passe par d&eacute;faut qui sera utilis&eacute; pour l'authentification par le courtier. La valeur par d&eacute;faut est <code>guest</code>.</p>
<p><b>D&eacute;sactiver l'API JMS setClientID() </b>Sp&eacute;cifie que l'application cliente ne peut pas utiliser les appels API pour modifier la valeur ClientID. Il est g&eacute;n&eacute;ralement pr&eacute;f&eacute;rable que ce soit vous, l'administrateur, qui contr&ocirc;liez l'attribution des valeurs ClientID.</p>
<p> Si vous cochez cette case, vous pouvez utiliser le champ <b>Configurer ClientID comme</b> pour sp&eacute;cifier un identifiant pour ce client. Si vous ne sp&eacute;cifiez pas cette valeur, une valeur par d&eacute;faut, &eacute;gale &agrave; l'adresse IP de l'h&ocirc;te client, est attribu&eacute;e par le syst&egrave;me. De ce fait, afin que ce soit plus pratique pour les d&eacute;veloppeurs, l'application cliente se voit interdire la cr&eacute;ation de plus d'une connexion&nbsp;: le syst&egrave;me ne permet pas deux connexions avec le m&ecirc;me identifiant client.</p>
<p><b>Configurer ClientID comme</b> Sp&eacute;cifie un identifiant pour le client. Si vous ne sp&eacute;cifiez pas cette valeur et que l'appel api d&eacute;terminant l'identifiant client est d&eacute;sactiv&eacute;, une valeur par d&eacute;faut, &eacute;gale &agrave; l'adresse IP de l'h&ocirc;te client, est attribu&eacute;e par le syst&egrave;me. De ce fait, afin que ce soit plus pratique pour les d&eacute;veloppeurs, l'application cliente se voit interdire la cr&eacute;ation de plus d'une connexion&nbsp;: le syst&egrave;me ne permet pas deux connexions avec le m&ecirc;me identifiant client.</p>
<p>&nbsp;</p>

</BODY>
</HTML>
