<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>add connfact handling</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
<H2>Ajouter Objet Classe de connexion &gt; <BR>Gestion des connexions</H2>
<p>Utilisez l'onglet Gestion des connexions pour configurer les connexions qui seront cr&eacute;&eacute;es par cette classe.</p>
<p><b>Liste des adresses du serveur de messagerie</b> Sp&eacute;cifie une liste d'adresses du serveur de messagerie (contenant au moins une adresse). Les adresses sont s&eacute;par&eacute;es par des virgules et chacune correspond &agrave; une instance du courtier &agrave; laquelle un moteur d'ex&eacute;cution client peut se connecter. Chaque adresse de la liste sp&eacute;cifie le nom de l'h&ocirc;te, le port h&ocirc;te et le service de connexion pour la connexion. <br> Pour plus d'informations sur la syntaxe des adresses du serveur de messagerie, <a href="message_server_syntax.htm">cliquez ici</a><br>
</p>
<p><b>Ordre de la liste d'adresses</b> Sp&eacute;cifie si les tentatives de connexion se font dans l'ordre des adresses de la liste des adresses du serveur de messagerie (PRIORIT&Eacute;) ou dans un ordre al&eacute;atoire (AL&Eacute;ATOIRE). Si trop de clients essaient de se connecter &agrave; l'aide de la m&ecirc;me classe de connexion, vous utiliserez un ordre al&eacute;atoire pour emp&ecirc;cher que tous se connectent &agrave; la m&ecirc;me adresse.<br>
</p>
<p><b>Nombre d'it&eacute;rations de la liste d'adresses </b>Sp&eacute;cifie combien de fois le moteur d'ex&eacute;cution client reviendra &agrave; la liste d'adresses du serveur de messagerie afin d'&eacute;tablir (ou de r&eacute;tablir) une connexion. La valeur -1 correspond &agrave; un nombre de tentatives illimit&eacute;.</p>
<p><b>Activer la reconnexion au service de messages</b> Si vous sp&eacute;cifiez la valeur vrai, le moteur d'ex&eacute;cution client tentera de se reconnecter &agrave; un serveur de messagerie (ou &agrave; la liste des adresses d'un serveur de messagerie) quand une connexion sera interrompue.<br>
</p>
<p><b>Nombre de tentatives de reconnexion</b> Sp&eacute;cifie combien de fois le moteur d'ex&eacute;cution client tentera de se reconnecter &agrave; l'aide d'une adresse de la liste d'adresses du serveur de messagerie avant de passer &agrave; l'adresse suivante de la liste. La valeur -1 correspond &agrave; un nombre de tentatives illimit&eacute;.<br>
</p>
<p><b>D&eacute;lai d'attente pour la reconnexion au service de messages (en milli&egrave;mes de seconde)</b> Sp&eacute;cifie la dur&eacute;e d'attente (en milli&egrave;mes de secondes) entre les tentatives de reconnexion pour chaque adresse de la liste d'adresses du serveur de messagerie, avant que le moteur d'ex&eacute;cution client essaie l'adresse suivante de la liste. Si cet intervalle est trop court, le courtier n'a pas le temps de proc&eacute;der &agrave; une r&eacute;cup&eacute;ration. S'il est trop long, le d&eacute;lai de reconnexion peut appara&icirc;tre inacceptable.<br>
</p>
<p><b>Intervalle d'envoi d'une commande ping aux connexions (en secondes) </b> Sp&eacute;cifie la fr&eacute;quence minimale (en secondes) &agrave; laquelle le moteur d'ex&eacute;cution client v&eacute;rifie que sa connexion avec le courtier est en &eacute;tat.<br>
</p>
<p>&nbsp;</p>

</BODY>
</HTML>
