<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>add connfact message header overrides</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>

<h2>Ajouter Objet Classe de connexion &gt; D&eacute;rogation d'en-t&ecirc;te de message</h2>

<p>Utilisez cet onglet pour d&eacute;roger aux champs d'en-t&ecirc;te de message JMS sp&eacute;cifiant la persistance, la dur&eacute;e de vie et la priorit&eacute; des messages. La d&eacute;rogation &agrave; ces valeurs &eacute;tant susceptible d'interf&eacute;rer avec les utilisateurs actifs ou les concepteurs d'application, veuillez les consulter pr&eacute;alablement &agrave; toute modification.</p>

<p><b style="font-weight: bold;">For&ccedil;age JMSDeliveryMode</b> Sp&eacute;cifie si le champ JMSDeliveryMode, d&eacute;termin&eacute; par le client, peut faire l'objet d'une d&eacute;rogation. Par d&eacute;faut&nbsp;: faux.</p>

<p><b style="font-weight: bold;">Valeur de JMSDeliveryMode</b> Sp&eacute;cifie la valeur de d&eacute;rogation de JMSDeliveryMode. Les valeurs sont 1 (non-persistant) ou 2 (persistant). Par d&eacute;faut&nbsp;: 2.</p>

<p><b style="font-weight: bold;">For&ccedil;age JMSExpiration</b> Sp&eacute;cifie si le champ JMSExpiration, d&eacute;termin&eacute; par le client, peut faire l'objet d'une d&eacute;rogation. Par d&eacute;faut&nbsp;: faux.</p>

<p><b style="font-weight: bold;">Valeur de JMSExpiration</b> Sp&eacute;cifie la valeur de d&eacute;rogation de JMSExpiration (en millisecondes). Par d&eacute;faut&nbsp;: 0 (illimit&eacute;).</p>

<p><b style="font-weight: bold;">For&ccedil;age JMSPriority</b> Sp&eacute;cifie si le champ JMSPriority, d&eacute;termin&eacute; par le client, peut faire l'objet d'une d&eacute;rogation. Par d&eacute;faut&nbsp;: faux.</p>

<p><b style="font-weight: bold;">Valeur de JMSPriority</b> Sp&eacute;cifie la valeur de d&eacute;rogation de JMSPriority (un entier entre 0 et 9). Par d&eacute;faut&nbsp;: 4 (normal).</p>

<p><b style="font-weight: bold;">For&ccedil;age des messages dans les destinations temporaires</b> Sp&eacute;cifie si les d&eacute;rogations s'appliquent aux destinations temporaires. Par d&eacute;faut&nbsp;: faux.</p>

<p>&nbsp;</p>

</body>

</html>
