<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<html>
<head>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <title>add broker</title>
 <link rel="StyleSheet" href="ide.css">
</head>
<body>
 <h2>Ajouter courtier</h2>
 
<p>Utilisez cette bo&icirc;te de dialogue pour cr&eacute;er la repr&eacute;sentation d'un courtier dans la fen&ecirc;tre de navigation de la console d'administration. Vous n'avez pas besoin de lancer le courtier pour cette action. Vous devrez lancer le courtier pour pouvoir vous connecter sur ce dernier.</p>

<p><b>&Eacute;tiquette courtier</b> Sp&eacute;cifie le nom que vous souhaitez voir affich&eacute; pour ce courtier dans la fen&ecirc;tre de navigation de la console d'administration. Il n'est pas n&eacute;cessaire que ce nom soit identique au nom d'instance du courtier.</p>

<p><b>H&ocirc;te</b> Sp&eacute;cifiez le nom de la machine h&ocirc;te de ce courtier ou conservez la valeur par d&eacute;faut <code>localhost</code>.</p>

<p><b>Port principal</b> Sp&eacute;cifie le num&eacute;ro du port assign&eacute; au mappeur de ports. La valeur par d&eacute;faut est 7676. La combinaison du nom d'h&ocirc;te et du num&eacute;ro de port principal identifie le courtier de mani&egrave;re unique. Pour ex&eacute;cuter deux instances d'un courtier sur un m&ecirc;me serveur, chaque mappeur de ports du courtier doit avoir un num&eacute;ro de port diff&eacute;rent.</p>

<p><b>Nom d'utilisateur</b> Sp&eacute;cifie votre nom d'utilisateur. La valeur par d&eacute;faut pour l'administrateur est <code>admin</code>. Cette information sert &agrave; vous authentifier lorsque vous essayez de vous connecter au courtier. La saisie dans cette bo&icirc;te de dialogue n'est pas s&eacute;curis&eacute;e. Si la s&eacute;curit&eacute; vous semble un &eacute;l&eacute;ment important, vous devez attendre le moment de connexion o&ugrave; cette information vous sera demand&eacute;e.</p>

<p><b>Mot de passe</b> Sp&eacute;cifie votre mot de passe utilisateur. La valeur par d&eacute;faut pour l'administrateur est <code>admin</code>. Cette information sert &agrave; vous authentifier lorsque vous essayez de vous connecter au courtier. La saisie dans cette bo&icirc;te de dialogue n'est pas s&eacute;curis&eacute;e. Si la s&eacute;curit&eacute; vous semble un &eacute;l&eacute;ment important, vous devez attendre le moment de connexion o&ugrave; cette information vous sera demand&eacute;e.</p>

<ul>
<li>Utilisez le bouton <b>OK</b> pour valider toutes les informations saisies et ajouter le courtier.
</ul>
<p>Pour vous connecter au courtier que vous avez ajout&eacute;&nbsp;:</p>

<ol>
  <li>S&eacute;lectionnez le courtier dans la fen&ecirc;tre de navigation de la console d'administration.</li>
  <li>S&eacute;lectionnez <b>Actions &gt; Se connecter au courtier</b>.</li>
</ol>

<p>Pour rechercher ou mettre &agrave; jour un courtier actif&nbsp;:</p>

<ol>
  <li>S&eacute;lectionnez le courtier dans la fen&ecirc;tre de navigation de la console d'administration.</li>
  <li>Connectez-vous s'il n'est pas d&eacute;j&agrave; connect&eacute;.
  <li>S&eacute;lectionnez <b>Actions &gt; Demander/Mettre &agrave; jour courtier.</b></li>
</ol>

<p>Pour modifier les informations sp&eacute;cifi&eacute;es dans cette fen&ecirc;tre pour un courtier particulier, vous devez&nbsp;: </p>

<ol>
  <li>S&eacute;lectionner le courtier dans la fen&ecirc;tre de navigation.</li>
  <li>D&eacute;connecter le courtier si ce n'est pas d&eacute;j&agrave; fait. Un courtier n'est pas d&eacute;connect&eacute; si son ic&ocirc;ne dans la fen&ecirc;tre de navigation ressemble &agrave; ce qui suit&nbsp;: <img src="../images/BrokerX16X.gif" alt="broker icon with super-imposed x"><br> Pour d&eacute;connecter un courtier, s&eacute;lectionnez <b>Actions &gt; Se d&eacute;connecter du courtier</b></li>
  <li>S&eacute;lectionnez <b>Actions &gt; Propri&eacute;t&eacute;s</b> pour ouvrir la fen&ecirc;tre Propri&eacute;t&eacute;s d'un courtier.</li>
</ol>

<p>&nbsp;</p>

</body>
</html>
