<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<html>
<head>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <title>add connection fact</title>
 <link rel="StyleSheet" href="ide.css">
 
</head>
<body>
 <h2>Ajouter Objet Classe de connexion</h2>
 
<p>Utilisez cette bo&icirc;te de dialogue pour configurer un objet de classe de connexion et l'ajouter &agrave; un magasin d'objets.</p>

<p>Les <i>classes de connexion</i> sont des objets administr&eacute;s utilis&eacute;s par les clients JMS pour se connecter &agrave; leur courtier. Cet objet sert &eacute;galement &agrave; sp&eacute;cifier le comportement de la connexion et comment le moteur d'ex&eacute;cution du client l'utilise pour acc&eacute;der au courtier.</p>

<p><b>Nom de recherche</b> Utilisez ce champ pour sp&eacute;cifier le nom de recherche JNDI de l'objet de classe de connexion. </p>

<p><b>Type de classe</b> S&eacute;lectionnez l'&eacute;l&eacute;ment de menu sp&eacute;cifiant le type de connexion produit par la classe&nbsp;: ConnectionFactory, QueueConnectionFactory ou TopicConnectionFactory. Si le message doit faire partie d'une transaction distribu&eacute;e, s&eacute;lectionnez XAConnectionFactory, XAQueueConnectionFactory ou XATopicConnectionFactory.</p>

<p><b>Lecture seule</b> Cochez cette case pour 	que l'objet de classe de connexion soit en lecture seule. Si l'objet est en lecture seule, les applications clientes ne pourront pas modifier les attributs de la classe de connexion &agrave; l'aide d'appels api. </p>

<p>En configurant l'objet de classe de connexion, vous sp&eacute;cifiez les propri&eacute;t&eacute;s communes &agrave; toutes les connexions produites par la classe. Vous utilisez les onglets pr&eacute;sent&eacute;s dans la bo&icirc;te de dialogue pour configurer la classe de connexion. Cliquez sur l'un des liens suivants pour obtenir des informations sur un onglet particulier.</p>

	
<a HREF="add_connfact_rel.htm">Fiabilit&eacute; et contr&ocirc;le de flux</a> <br> <a HREF="add_connfact_queue.htm">QueueBrowsers et ServerSessions</a><br> <a HREF="add_connfact_handling.htm">Gestion des connexions</a><br> <a HREF="add_connfact_clientid.htm">Identification du client</a> <br> <a HREF="add_connfact_jmsx.htm">Propri&eacute;t&eacute;s JMSX</a> <br> <a HREF="add_connfact_message_header_overrides.htm">D&eacute;rogation d'en-t&ecirc;te de message</a><br> <a HREF="add_connfact_handling_old.htm">Gestion des connexions 3.0</a><br>
  	 

<ul>
  <li>Cliquez sur <b>Restaurer les param&egrave;tres par d&eacute;faut</b> pour r&eacute;initialiser tous les champs de toutes les bo&icirc;tes de dialogue sur leurs valeurs par d&eacute;faut. </li>
  <li> Cliquez sur <b>OK</b> pour cr&eacute;er l'objet de classe de connexion. </li>
</ul>

<p>Pour modifier les propri&eacute;t&eacute;s d'un objet de classe de connexion&nbsp;:</p>

<ol>
  <li>S&eacute;lectionnez le dossier Classes de connexion dans la fen&ecirc;tre de navigation de la console d'administration. </li>
  <li>S&eacute;lectionnez l'objet de classe de connexion dans la fen&ecirc;tre de r&eacute;sultats de la console d'administration. </li>
  <li>S&eacute;lectionnez <b>Actions &gt; Propri&eacute;t&eacute;s</b> pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s d'objet de classe de connexion. </li>
</ol>

<p>&nbsp;</p>

</body>
</html>
