<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<html>
<head>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <title>add object store</title>
 <link rel="StyleSheet" href="ide.css">
 
</head>
<body>
<h2>Ajouter Object Store</h2>
<p>Utilisez cette bo&icirc;te de dialogue pour ajouter un magasin d'objet existant &agrave; la fen&ecirc;tre de navigation de votre console d'administration. Apr&egrave;s l'ajout du magasin d'objets, vous pouvez vous y connecter et commencer &agrave; lui ajouter des objets de destination et des objets de classe de connexion. </p>
<p>Un <i>magasin d'objets</i> contient les objets que vous cr&eacute;ez&nbsp;: <i>objets de destination</i> et <i>objets de classe de connexion</i>. Son contenu est accessible &agrave; l'aide d'un code de recherche JNDI standard appel&eacute; par l'application client. Un magasin d'objets peut &ecirc;tre bas&eacute; sur des fichiers ou peut &ecirc;tre un serveur LDAP. Si vous souhaitez un magasin bas&eacute; sur des fichiers, vous devez lui cr&eacute;er un dossier. Si vous souhaitez utiliser un serveur LDAP, vous devez le configurer et le lancer. </p>
<p><b>&Eacute;tiquette Object Store</b>&nbsp;: Sp&eacute;cifie le nom du magasin d'objets. Ce nom sera affich&eacute; dans la fen&ecirc;tre de navigation de la console d'administration.</p>
<p><b>Propri&eacute;t&eacute;s du service d'affectation des noms JNDI</b>&nbsp;: Utilisez les commandes de cette zone pour d&eacute;finir la liste des propri&eacute;t&eacute;s JNDI pour ce magasin d'objets. Utilisez la liste d&eacute;roulante <b>Nom</b> pour s&eacute;lectionner un nom de propri&eacute;t&eacute;. Apr&egrave;s avoir s&eacute;lectionn&eacute; le nom de propri&eacute;t&eacute;, utilisez le champ <b>Valeur</b> pour saisir la valeur de la propri&eacute;t&eacute;.</p>
<p> Voir <code>http://java.sun.com/products/jndi/1.2/javadoc/</code> pour en savoir plus sur l'interface de programmation d'application (api) JNDI. Vous devez d&eacute;finir les propri&eacute;t&eacute;s <code>java.naming.factory.initial et java.naming.provider.url</code>. </p>
<p>Il existe deux valeurs pour la propri&eacute;t&eacute; de contexte initial (<code>java.naming.factory.initial</code>) :</p>
<ul>
  <li>Magasin de syst&egrave;me de fichiers : <code>com.sun.jndi.fscontext.RefFSContextFactory</code></li>
  <li>Serveur LDAP : <code>com.sun.jndi.ldap.LdapCtxFactory</code></li>
</ul>
<p>Vous devez &eacute;galement sp&eacute;cifier les informations d'authentification. Cependant, si la s&eacute;curit&eacute; vous semble un &eacute;l&eacute;ment important, vous pouvez attendre le moment de connexion o&ugrave; cette information vous sera demand&eacute;e</p>

<ul>
  <li>Apr&egrave;s avoir sp&eacute;cifi&eacute; les nom et valeur de la propri&eacute;t&eacute;, cliquez sur le bouton <b>Ajouter</b> pour l'ajouter &agrave; la table.</li>
  <li>Pour supprimer une propri&eacute;t&eacute; que vous avez d&eacute;j&agrave; ajout&eacute;e, s&eacute;lectionnez-la dans la table et cliquez sur le bouton <b>Supprimer</b>.</li>
  <li>Utilisez le bouton <b>Effacer</b> pour annuler toutes les entr&eacute;es.</li>
  <li>Pour configurer &agrave; nouveau une propri&eacute;t&eacute;, s&eacute;lectionnez une entr&eacute;e, modifiez ses valeurs et utilisez le bouton <b>Modifier</b> pour valider la nouvelle configuration de cette propri&eacute;t&eacute;.</li>
  <li>Utilisez le bouton <b>OK</b> pour appliquer tous les param&egrave;tres de propri&eacute;t&eacute; et ajouter le magasin d'objets.</li>
</ul>
<p>Pour modifier les propri&eacute;t&eacute;s d'un magasin d'objets existant, vous devez suivre la proc&eacute;dure suivante&nbsp;: 
</p>

<ol>
  <li>D&eacute;connectez-vous du magasin d'objets si ce n'est pas d&eacute;j&agrave; fait. Un magasin d'objets est d&eacute;connect&eacute; si son ic&ocirc;ne dans la fen&ecirc;tre de navigation ressemble &agrave; ce qui suit&nbsp;: <img src="../images/ObjectStoreX16X.gif" alt="ic&ocirc;ne de magasin d'objets avec un x"><br> Pour d&eacute;connecter un magasin d'objets, s&eacute;lectionnez-le dans la fen&ecirc;tre de navigation et s&eacute;lectionnez <b>Actions &gt; Se d&eacute;connecter du magasin d'objets</b>. </li>
  <li>S&eacute;lectionnez <b>Actions &gt; Propri&eacute;t&eacute;s</b> pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s d'un magasin d'objets.</li>
</ol>

<p>Pour ajouter un objet de destination au magasin d'objets, cliquez sur le dossier Destinations et s&eacute;lectionnez <b> Actions &gt; Ajouter objet de destination.</b> </p>

<p>Pour ajouter une classe de connexion au magasin d'objets, cliquez sur le dossier Classe de connexion et s&eacute;lectionnez <b>Actions &gt; Ajouter Objet Classe de connexion. </b></p>

<p>&nbsp;</p>

</body>
</html>
