<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>add connfact jmsx</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Ajouter Objet Classe de connexion &gt; <BR>Propri&eacute;t&eacute;s JMSX</H2>
 
<P>Utilisez cet onglet pour sp&eacute;cifier les propri&eacute;t&eacute;s d&eacute;finies par JMS devant &ecirc;tre configur&eacute;es par Message Queue.</P>
<p>Message Queue peut prendre en charge un certain nombre d'attributs d&eacute;finis par JMS, mais ceci est co&ucirc;teux en termes de ressources. Pour pr&eacute;server les ressources, vous devez identifier les propri&eacute;t&eacute;s r&eacute;ellement n&eacute;cessaires &agrave; l'application client et activer ces seules propri&eacute;t&eacute;s en cochant la case appropri&eacute;e.</p>
<p><b>Activer la propri&eacute;t&eacute; de message JMSXAppID</b>&nbsp;: sp&eacute;cifie si Message Queue doit activer la propri&eacute;t&eacute; d&eacute;finie par JMS, JMSXAppID (identit&eacute; de l'application &eacute;mettant le message), sur les messages produits. Par d&eacute;faut&nbsp;: faux</p>
<p><b>Activer la propri&eacute;t&eacute; de message JMSXUserID</b>&nbsp;: sp&eacute;cifie si Message Queue doit activer la propri&eacute;t&eacute; d&eacute;finie par JMS, JMSXUserID (identit&eacute; de l'utilisateur &eacute;mettant le message), sur les messages produits. Par d&eacute;faut&nbsp;: faux</p>
<p><b>Activer la propri&eacute;t&eacute; de message JMSXProducerTXID</b>&nbsp;: sp&eacute;cifie si Message Queue doit activer la propri&eacute;t&eacute; d&eacute;finie par JMS, JMSXProducerTXID (identifiant de la transaction au sein de laquelle le message a &eacute;t&eacute; produit), sur les messages produits. Par d&eacute;faut&nbsp;: faux</p>
<p><b>Activer la propri&eacute;t&eacute; de message</b> <b>JMSXConsumerTXID</b>&nbsp;: sp&eacute;cifie si Message Queue doit activer la propri&eacute;t&eacute; d&eacute;finie par JMS, JMSXConsumerTXID (identifiant de la transaction au sein de laquelle le message a &eacute;t&eacute; consomm&eacute;), sur les messages consomm&eacute;s. Par d&eacute;faut&nbsp;: faux</p>
<p><b>Activer la propri&eacute;t&eacute; de message JMSXRcvTimestamp</b>&nbsp;: sp&eacute;cifie si Message Queue doit activer la propri&eacute;t&eacute; d&eacute;finie par JMS, JMSXRcvTimestamp (l'heure o&ugrave; le message est livr&eacute; au consommateur), sur les messages consomm&eacute;s. Par d&eacute;faut&nbsp;: faux</p>
<p>&nbsp;</p>

</BODY>
</HTML>
