<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>add destination obj</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Ajouter objet de destination</H2>
 
<P>Utilisez cette bo&icirc;te de dialogue pour ajouter un objet de destination &agrave; un magasin d'objets. </P>

<P>Un <i>objet administr&eacute; par destination</i> est une repr&eacute;sentation, ind&eacute;pendante du fournisseur, d'une destination physique (une file d'attente ou une rubrique) pour un courtier. </P>

<P><b>Nom de recherche</b> Utilisez ce champ pour sp&eacute;cifier le nom de recherche JNDI de l'objet administr&eacute;. Ce nom peut &ecirc;tre le m&ecirc;me que le nom de destination&nbsp;; la seule contrainte est qu'il doit &ecirc;tre unique dans le contexte du magasin d'objets. </P>

<P><b>Type de destination</b> Activez la case d'option correspondant au type de destination&nbsp;: file d'attente ou rubrique. </P>

<P><b>Lecture seule</b> Cochez cette case pour que l'objet soit en lecture seule. Si l'objet est en lecture seule, les applications clientes ne pourront pas modifier les attributs de l'objet administr&eacute; &agrave; l'aide d'appels api. </P>

<P><b>Nom destination</b> Utilisez ce champ pour sp&eacute;cifier le nom de la destination physique sur le courtier &agrave; laquelle cet objet administr&eacute; correspond. Si vous ne sp&eacute;cifiez aucun nom, le nom par d&eacute;faut est <code>Untitled_Destination_Object</code>. </P>

<P><b>Description de la destination</b> Utilisez ce champ pour saisir une description utile de cet objet destination.</P>

<ul>
  <li>Cliquez sur le bouton <b>Restaurer les param&egrave;tres par d&eacute;faut</b> pour r&eacute;initialiser tous les champs sur leurs valeurs par d&eacute;faut. </li>
  <li> Cliquez sur <b>OK</b> pour cr&eacute;er l'objet de destination. </li>
</ul>

<p>Pour modifier les propri&eacute;t&eacute;s d'un objet de destination </p>

<ol>
  <li>S&eacute;lectionnez le dossier Destinations dans la fen&ecirc;tre de navigation de la console d'administration. </li>
  <li>S&eacute;lectionnez l'objet de destination dans la fen&ecirc;tre des r&eacute;sultats de la console d'administration. </li>
  <li>S&eacute;lectionnez <b>Actions &gt; Propri&eacute;t&eacute;s</b> pour afficher la bo&icirc;te de dialogue Propri&eacute;t&eacute;s de l'objet de destination. </li>
</ol>

<P>&nbsp;</P>

</BODY>
</HTML>
