<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>broker config basic</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Demander/mettre &agrave; jour courtier &gt; <BR> De base</H2>
 
<P>Utilisez cet onglet pour sp&eacute;cifier ou parcourir les informations de configuration de base d'une instance courtier.</P>

<P><b>Version</b> Sp&eacute;cifie la version du courtier.</P>

<P><b>Nom d'instance</b> Sp&eacute;cifie le nom par d&eacute;faut <code>imqbroker</code> ou le nom que vous avez assign&eacute; au courtier lorsque vous l'avez lanc&eacute;.</P>

<P><b>Port principal</b> Sp&eacute;cifie le num&eacute;ro du port de mappeur de ports du courtier. Le mappeur de ports est responsable de l'attribution dynamique des ports aux services Message Queue. Ce devrait &ecirc;tre le m&ecirc;me num&eacute;ro que celui sp&eacute;cifi&eacute; lorsque vous avez lanc&eacute; le courtier.</P>

<P><b>Cr&eacute;ation automatique de rubriques</b> Sp&eacute;cifie si le courtier est autoris&eacute; &agrave; cr&eacute;er une destination de type rubrique d&egrave;s lors qu'un consommateur ou un producteur de message tente d'acc&eacute;der &agrave; une destination inexistante. </P>

<P><b>Cr&eacute;ation automatique de files d'attente</b> Sp&eacute;cifie si le courtier est autoris&eacute; &agrave; cr&eacute;er une destination de type file d'attente d&egrave;s lors qu'un consommateur ou un producteur de message tente d'acc&eacute;der &agrave; une destination inexistante.</P>

<P><b>Nombre maximal de consommateurs actifs dans une file d'attente cr&eacute;&eacute;e automatiquement</b> Sp&eacute;cifie le nombre maximal de consommateurs qui peuvent &ecirc;tre actifs dans le cadre d'une livraison avec &eacute;quilibrage de charge &agrave; partir d'une destination de type file d'attente.</P>
<P><b>Nombre maximal de consommateurs de remplacement dans une file d'attente cr&eacute;&eacute;e automatiquement</b>&nbsp;: sp&eacute;cifie le nombre maximal de consommateurs pouvant remplacer les consommateurs actifs en cas d'&eacute;chec de ces derniers pendant une livraison avec &eacute;quilibrage de charge &agrave; partir d'une destination de type file d'attente. 
</P>


</BODY>
</HTML>
