<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>broker information</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Propri&eacute;t&eacute;s d'un courtier</H2>
 
<P>Utilisez cette bo&icirc;te de dialogue pour modifier la repr&eacute;sentation d'un courtier dans la fen&ecirc;tre de navigation de la console d'administration. Vous n'avez pas besoin de lancer le courtier pour cette action. Pour modifier les champs de cette bo&icirc;te de dialogue, vous devez d&eacute;connecter la console d'administration du courtier, puis afficher de nouveau cette bo&icirc;te de dialogue. </P>

<p><b>&Eacute;tiquette courtier</b> Sp&eacute;cifie le nom que vous souhaitez voir affich&eacute; pour ce courtier dans la fen&ecirc;tre de navigation de la console d'administration. Il n'est pas n&eacute;cessaire que ce nom soit identique au nom d'instance du courtier.</p>

<p><b>H&ocirc;te</b> Sp&eacute;cifiez le nom de la machine h&ocirc;te de ce courtier ou laissez la valeur par d&eacute;faut de localhost.</p>

<p><b>Port principal</b> Sp&eacute;cifie le num&eacute;ro du port assign&eacute; au mappeur de ports. Cette combinaison du nom d'h&ocirc;te et du num&eacute;ro de port principal identifie le courtier de mani&egrave;re unique. Pour ex&eacute;cuter deux instances d'un courtier sur un m&ecirc;me serveur, chaque mappeur de ports du courtier doit avoir un num&eacute;ro de port diff&eacute;rent.</p>

<p><b>Nom d'utilisateur</b> Sp&eacute;cifie votre nom d'utilisateur. La valeur par d&eacute;faut pour l'administrateur est <code>admin</code>. Cette information sert &agrave; vous authentifier lorsque vous essayez de vous connecter au courtier. La saisie dans cette bo&icirc;te de dialogue n'est pas s&eacute;curis&eacute;e. Si la s&eacute;curit&eacute; vous semble un &eacute;l&eacute;ment important, vous devez attendre le moment de connexion o&ugrave; cette information vous sera demand&eacute;e.</p>

<p><b>Mot de passe</b> Sp&eacute;cifie votre mot de passe utilisateur. La valeur par d&eacute;faut pour l'administrateur est <code>admin</code>. Cette information sert &agrave; vous authentifier lorsque vous essayez de vous connecter au courtier. La saisie dans cette bo&icirc;te de dialogue n'est pas s&eacute;curis&eacute;e. Si la s&eacute;curit&eacute; vous semble un &eacute;l&eacute;ment important, vous devez attendre le moment de connexion o&ugrave; cette information vous sera demand&eacute;e.</p>
<p>Pour reconnecter le courtier&nbsp;:</p>

<ol>
  <li>S&eacute;lectionnez le courtier dans la fen&ecirc;tre de navigation de la console d'administration.</li>
  <li>S&eacute;lectionnez <b>Actions &gt; Se connecter au courtier</b>.</li>
</ol>

<p>&nbsp;</p>

</BODY>
</HTML>
