<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>broker config logging</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Demander/mettre &agrave; jour courtier &gt; <BR> Journalisation</H2>
 
<P>Utilisez cet onglet pour configurer la journalisation pour une instance courtier.</P>

<P><b>Niveau du journal</b> Sp&eacute;cifie le niveau de journalisation qui peut &ecirc;tre &eacute;crit vers tout canal de sortie. Les cat&eacute;gories, par ordre d&eacute;croissant de gravit&eacute;, sont <code>ERROR</code>, <code>WARNING</code> et <code>INFO</code>. Utilisez la liste d&eacute;roulante pour s&eacute;lectionner une cat&eacute;gorie. Lorsque vous s&eacute;lectionnez une cat&eacute;gorie, le journal &eacute;crit les donn&eacute;es de la cat&eacute;gorie sp&eacute;cifi&eacute;e et des cat&eacute;gories sup&eacute;rieures. Ainsi, si vous s&eacute;lectionnez <code>INFO</code>, vous obtenez les donn&eacute;es des trois cat&eacute;gories. Si vous s&eacute;lectionnez <code>ERREUR</code>, vous obtenez uniquement les messages <code>ERREUR</code>. La valeur par d&eacute;faut est <code>INFO</code>.</P>

<P><b>Taille du report de</b> <b>journal</b> Sp&eacute;cifie la taille du fichier journal d&eacute;clenchant le report de la sortie sur un nouveau fichier journal. Utilisez la liste d&eacute;roulante pour s&eacute;lectionner l'unit&eacute;&nbsp;: octets, kilo-octets ou m&eacute;ga-octets. Cliquez sur la case d'option Illimit&eacute; si vous ne voulez pas que la taille du fichier journal d&eacute;clenche un report. La s&eacute;lection par d&eacute;faut est Illimit&eacute;.</P>

<P><b>Intervalle de report du journal</b> Sp&eacute;cifie l'&acirc;ge, en secondes, du fichier journal d&eacute;clenchant le report de la sortie sur un nouveau fichier journal. Cliquez sur la case d'option Illimit&eacute; si vous ne voulez pas que l'&acirc;ge du fichier d&eacute;clenche un report. La valeur par d&eacute;faut est 604800.</P>

<P>&nbsp;</P>

</BODY>
</HTML>
