<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>connfact rel</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Propri&eacute;t&eacute;s de l'objet Classe de connexion &gt; <BR> Fiabilit&eacute; et contr&ocirc;le de flux</H2>
 
<P>Utilisez cet onglet pour sp&eacute;cifier de nouveau l'usage des messages de contr&ocirc;le Message Queue (acceptations courtier) et des mesures de contr&ocirc;le de flux par le moteur d'ex&eacute;cution client.</P>
<p><b>Accus&eacute; de r&eacute;ception par le service de messages des messages produits</b> Sp&eacute;cifie l'acceptation par le courtier des messages du client producteur&nbsp;:</p>

<ul>
  <li>Si la valeur sp&eacute;cifi&eacute;e est true, le courtier accuse r&eacute;ception de tous les messages JMS (permanents et non permanents) du client producteur et le thread de ce client se bloque, en attente de ces acceptations.</li>
  <li>Si la valeur sp&eacute;cifi&eacute;e est false, le courtier n'accuse pas r&eacute;ception des messages JMS (permanents et non permanents) du client producteur et le thread de ce client ne se bloque pas dans l'attente des acceptations du courtier.</li>
  <li> Sans sp&eacute;cification, le courtier accuse r&eacute;ception des messages permanents uniquement et le thread du client producteur est bloqu&eacute; en attente de ces acceptations.</li>
</ul>

<p><b>Accus&eacute; de r&eacute;ception par le service de messages des accus&eacute;s de r&eacute;ception client </b>Sp&eacute;cifie l'acceptation par le courtier des acceptations client consommateur&nbsp;:</p>

<ul>
  <li>Si la valeur sp&eacute;cifi&eacute;e est true, le courtier accuse r&eacute;ception de toutes les acceptations du client consommateur et le thread de ce client se bloque, en attente de ces acceptations.</li>
  <li>Si la valeur sp&eacute;cifi&eacute;e est false, le courtier n'accuse pas r&eacute;ception des acceptations du client consommateur et le thread de ce client se ne bloque pas en attente des acceptations du courtier.</li>
  <li> Si aucune valeur n'est sp&eacute;cifi&eacute;e, le courtier accuse r&eacute;ception des acceptations du client consommateur pour les modes AUTO_ACKNOWLEDGE et CLIENT_ACKNOWLEDGE (et le thread du client consommateur se bloque, en attente de ces acceptations), mais pas pour le mode DUPS_OK_ACKNOWLEDGE (et le thread du client consommateur ne se bloque pas).</li>
</ul>
<p><b>Temporisation de l'accus&eacute; de r&eacute;ception par le service de messages (millisecondes) </b>Sp&eacute;cifie le d&eacute;lai maximal (en milli&egrave;mes de seconde) d'attente par le moteur d'ex&eacute;cution de l'acceptation courtier avant d'opposer une exception. La valeur par d&eacute;faut est de 0 et signifie qu'il n'y a pas de d&eacute;lai&nbsp;; en d'autres termes, le moteur d'ex&eacute;cution peut attendre ind&eacute;finiment.</p>
<p><b>Nombre maximal de messages du flux de connexion</b> Sp&eacute;cifie le nombre maximal de messages JMS d'un lot comptabilis&eacute;. Lorsque ce nombre de messages est livr&eacute; au moteur d'ex&eacute;cution client, la livraison est suspendue temporairement, permettant la livraison de tous les message de contr&ocirc;le ayant &eacute;t&eacute; retenus. La livraison des messages JMS reprend sur notification du moteur d'ex&eacute;cution client et continue jusqu'au lot suivant. Si le compteur est r&eacute;gl&eacute; sur 0, le nombre de messages JMS d'un lot comptabilis&eacute; n'est pas limit&eacute;. Une valeur autre que z&eacute;ro permet au moteur d'ex&eacute;cution client de comptabiliser le flux des messages de sorte que les messages de contr&ocirc;le Message Queue ne soient pas bloqu&eacute;s par une livraison de messages JMS volumineuse et puissent parvenir au client entre les lots comptabilis&eacute;s.</p>

<p><b>Limite du flux de connexion activ&eacute;e</b> Sp&eacute;cifie si une limite du flux de connexion doit &ecirc;tre activ&eacute;e (pour le nombre de messages non consomm&eacute;s livr&eacute;s au moteur d'ex&eacute;cution client). Si cette case est coch&eacute;e, vous devez sp&eacute;cifier un nombre positif dans le champ <b>Limite de flux de connexion</b>.</p>
<p><b>Limite du flux de connexion (messages non consomm&eacute;s par connexion) </b>Sp&eacute;cifie une limite au nombre de messages qui peuvent &ecirc;tre livr&eacute;s lors d'une connexion et mis en m&eacute;moire tampon dans le moteur d'ex&eacute;cution du client, dans l'attente d'&ecirc;tre consomm&eacute;s (cette option n'est utilis&eacute;e que si la case <b>Limite du flux de connexion activ&eacute;e</b>est coch&eacute;e). Lorsque le nombre de messages JMS livr&eacute;s au moteur d'ex&eacute;cution client (en accord avec la comptabilisation de flux d&eacute;finie dans <b>Nombre maximal de messages du flux de connexion</b>) d&eacute;passe cette limite, la livraison de messages cesse. Elle reprend uniquement lorsque le nombre de messages non consomm&eacute;s passe de nouveau sous la valeur d&eacute;finie pour cette propri&eacute;t&eacute;. Cette limite &eacute;vite &agrave; un client consommateur tr&egrave;s lent pour traiter les messages d'&ecirc;tre submerg&eacute; de messages en attente susceptibles de saturer sa m&eacute;moire. </p>

<P><b>Limite du flux de messages par consommateur (messages non cosomm&eacute;s par consommateur) </b>Sp&eacute;cifie une limite au nombre de messages par consommateur qui peuvent &ecirc;tre livr&eacute;s dans le cadre d'une connexion et mis en m&eacute;moire tampon sur le moteur d'ex&eacute;cution client. Cette limite remplit deux fonctions : elle peut am&eacute;liorer l'&eacute;quilibrage de la charge entre les consommateurs dans le cas de livraisons &agrave; des files d'attente de plusieurs consommateurs (il est alors impossible d'envoyer un nombre de messages trop &eacute;lev&eacute; &agrave; un consommateur), et contribue &agrave; emp&ecirc;cher un consommateur d'une connexion d'inonder de messages d'autres consommateurs de cette connexion. Quand le nombre de messages JMS livr&eacute;s au moteur d'ex&eacute;cution client d&eacute;passe cette limite pour un consommateur, la livraison des messages cesse pour ce consommateur. Elle reprend uniquement lorsque le nombre de messages non consomm&eacute;s pour ce consommateur descend sous la valeur d&eacute;finie avec l'option <b>Seuil du flux de consommateurs</b>. </P>
<P>Notez que si le nombre total de messages mis en m&eacute;moire tampon pour tous les consommateurs d'une connexion d&eacute;passe la valeur fix&eacute;e pour <b>Limite de flux de connexion</b>, la livraison des messages via la connexion cesse jusqu'&agrave; ce que le total revienne sous cette limite. Si vous sp&eacute;cifiez une limite pour le flux de messages par consommateur, il est inutile d'indiquer une limite de flux de connexion, sauf dans des cas tr&egrave;s particuliers, et la plupart des besoins des applications en mati&egrave;re de comptabilisation de flux de messages seront couverts en d&eacute;finissant une limite pour le flux de messages par consommateur plut&ocirc;t qu'en activant l'option Limite de flux de connexion.</P>
<P><b>Seuil du flux de consommateurs (pourcentage) </b>Sp&eacute;cifie, sous forme de pourcentage, le nombre apparaissant dans <b>Limite du flux de messages par consommateur</b>, c'est-&agrave;-dire le nombre de messages par consommateur mis en m&eacute;moire tampon dans le moteur d'ex&eacute;cution client, en dessous duquel la livraison des messages destin&eacute;s &agrave; un consommateur reprendra. </P>
<P>&nbsp;</P>
<P>&nbsp;</P>

</BODY>
</HTML>
