<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Aper&ccedil;u</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H1>Aper&ccedil;u</H1>
 
<P> Vous utilisez la console d'administration pour communiquer avec un ou plusieurs courtiers Message Queue et magasins d'objets.</P>
<P>La console d'administration est divis&eacute;e en cinq fen&ecirc;tres, comme indiqu&eacute; ci-dessous.</P>
<P><img src="../images/console.gif" alt="Diagram of the administration console separated into five zones."></P>
<UL>
<LI>1 - barre de menu
<LI>2 - barre d'outils
<LI>3 - fen&ecirc;tre de navigation
<LI>4 - fen&ecirc;tre de r&eacute;sultats
<LI>5 - fen&ecirc;tre de statut
</UL>
<P>Vous utilisez les menus de la <b>barre de</b> <b>menu</b> ou les ic&ocirc;nes de la <b>barre d'outils</b> pour agir sur les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s dans la <b>fen&ecirc;tre de navigation</b> et dans la <b>fen&ecirc;tre de r&eacute;sultats</b>.
  
  La <b>fen&ecirc;tre de statut</b> affiche les informations sur l'action la plus r&eacute;cemment r&eacute;alis&eacute;e.</P>
<P>La fen&ecirc;tre de navigation affiche une arborescence des magasins d'objets et des courtiers auxquels vous &ecirc;tes connect&eacute;. Les magasins d'objets contiennent des objets administr&eacute;s, pouvant &ecirc;tre des destinations (file d'attente ou rubrique) ou des classes de connexion. Les courtiers contiennent un ensemble de services et de destinations physiques.</P>
<ul>
  <li>Pour consulter les destinations d'un magasin d'objets, cliquez sur le dossier Destinations. Son contenu s'affiche dans la fen&ecirc;tre de r&eacute;sultats.</li>
  <li>Pour consulter des informations sur les classes de connexion d'un magasin d'objets, cliquez sur le dossier Classes de connexion. Le nom de recherche et le type de chaque classe de connexion sont affich&eacute;s dans la fen&ecirc;tre de r&eacute;sultats.</li>
  <li>Pour consulter des informations sur les services disponibles chez un courtier, cliquez sur le dossier Services. Une liste des services, le num&eacute;ro de port de chaque service et le statut sont affich&eacute;s dans la fen&ecirc;tre de r&eacute;sultats.</li>
  <li>Pour afficher/modifier les informations d'un service particulier, s&eacute;lectionnez-le dans la fen&ecirc;tre de r&eacute;sultats et s&eacute;lectionnez <b>Actions &gt; Propri&eacute;t&eacute;s</b>.</li>
  <li>Pour consulter des informations sur les destinations physiques sur un courtier, cliquez sur le dossier Destinations. Une liste des destinations ayant &eacute;t&eacute; cr&eacute;&eacute;es chez ce courtier s'affiche, avec le type des destinations et, pour une file d'attente, sa politique de livraison. </li>
  <li>Pour afficher/modifier les informations d'une destination particuli&egrave;re, s&eacute;lectionnez-la dans la fen&ecirc;tre de r&eacute;sultats et s&eacute;lectionnez <b>Actions &gt; Propri&eacute;t&eacute;s</b>.</li>
</ul>
<P>Pour modifier les propri&eacute;t&eacute;s d'un magasin d'objets ou d'un courtier, vous devez d'abord vous d&eacute;connecter.</P>
<P>La console d'administration vous donne acc&egrave;s aux fonctions de base de l'administration Message Queue via une interface graphique. Cependant, beaucoup d'autres fonctions sont disponibles si vous utilisez l'utilitaire de commande Message Queue ad&eacute;quat. Pour plus d'informations, consultez le guide <i>Message Queue Administrator's Guide</i>.</P>
</BODY>
</HTML>
