<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Verbindungs-Factory-Objekt hinzuf&uuml;gen &gt; JMS-Meldungs-Header-&Auml;nderungen</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>

<h2>Verbindungs-Factory-Objekt hinzuf&uuml;gen &gt; JMS-Meldungs-Header-&Auml;nderungen</h2>

<p>Mit Hilfe der Optionen auf dieser Registerkarte k&ouml;nnen Sie die JMS-Meldungs-Header-Felder &auml;ndern, in denen die Persistenz, Lebensdauer und Priorit&auml;t von Meldungen festgelegt ist. Da das &Auml;ndern dieser Werte zu Konflikten mit aktuellen Benutzern oder Anwendungsdesignern f&uuml;hren kann, sollten Sie sich mit diesen in Verbindung setzen, bevor Sie irgendwelche &Auml;nderungen vornehmen.</p>

<p><b style="font-weight: bold;">JMSDeliveryMode &uuml;berschreiben</b>: Legt fest, ob das vom Client festgelegte Feld <b style="font-weight: bold;">JMSDeliveryMode</b> &uuml;berschrieben werden kann. Standardeinstellung: false.</p>

<p><b style="font-weight: bold;">JMSDeliveryMode-Wert</b>: Legt den &Uuml;berschreibungswert f&uuml;r <b style="font-weight: bold;">JMSDeliveryMode</b> fest. M&ouml;gliche Werte sind: <b style="font-weight: bold;">1</b> (nicht persistent) und <b style="font-weight: bold;">2</b> (persistent). Standardeinstellung: 2.</p>

<p><b style="font-weight: bold;">JMSExpiration &uuml;berschreiben</b>: Legt fest, ob das vom Client festgelegte Feld <b style="font-weight: bold;">JMSExpiration</b> &uuml;berschrieben werden kann. Standardeinstellung: false.</p>

<p><b style="font-weight: bold;">JMSExpiration-Wert</b>: Legt den &Uuml;berschreibungswert f&uuml;r <b style="font-weight: bold;">JMSExpiration</b> (in Millisekunden) fest. Standardeinstellung: <b style="font-weight: bold;">0</b> (l&auml;uft nicht ab).</p>

<p><b style="font-weight: bold;">JMSPriority &uuml;berschreiben</b>: Legt fest, ob das vom Client festgelegte Feld <b style="font-weight: bold;">JMSPriority</b> &uuml;berschrieben werden kann. Standardeinstellung: false.</p>

<p><b style="font-weight: bold;">JMSPriority-Wert</b>: Legt den &Uuml;berschreibungswert f&uuml;r <b style="font-weight: bold;">JMSPriority</b> fest (Ganzzahl zwischen 0 und 9). Standardeinstellung: <b style="font-weight: bold;">4</b> (normal).</p>

<p><b style="font-weight: bold;">Meldungen an tempor&auml;re Ziele &uuml;berschreiben</b>: Legt fest, ob sich &Uuml;berschreibungen auf tempor&auml;re Ziele auswirken. Standardeinstellung: false.</p>

<p>&nbsp;</p>

</body>

</html>
