<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Verbindungs-Factory-Objekt hinzuf&uuml;gen &gt; Verbindungs-Handling</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
<H2>Verbindungs-Factory-Objekt hinzuf&uuml;gen &gt; Verbindungs-Handling</H2>
<p>Mit Hilfe der Optionen auf der Registerkarte <B>Verbindungs-Handling</B> k&ouml;nnen Sie die Verbindungen konfigurieren, die von diesem Factory-Objekt erstellt werden.</p>
<p><b>Adressliste des Meldungsservers</b>: Gibt eine durch Komma getrennte Liste mit Meldungsserveradressen (mindestens eine) an. Jede dieser Adressen bezieht sich auf eine andere Broker-Instanz, mit der eine Client-Runtime eine Verbindung herstellen kann. Jede Adresse in der Liste enth&auml;lt den Hostnamen, Hostanschluss und den Verbindungsdienst f&uuml;r die Verbindung. <br> Um weitere Informationen zur Adresssyntax des Meldungsservers zu erhalten, <a href="message_server_syntax.htm">klicken Sie hier</a><br>.
</p>
<p><b>Adresslistenreihenfolge</b>: Gibt an, ob die Verbindungsversuche in der Reihenfolge der Adressen in der Meldungsserveradressliste (PRIORITY) oder in einer zuf&auml;lligen Reihenfolge (RANDOM) erfolgen. Falls mehrere Clients einen Verbindungsversuch mithilfe derselben Verbindungs-Factory vornehmen, verwenden Sie die zuf&auml;llige Reihenfolge, damit nicht alle Verbindungen mit ein und derselben Adresse erfolgen.<br>
</p>
<p><b>Anzahl der Adresslisteniterationen</b>: Gibt die Anzahl der Wiederholungen an, mit der eine Client-Runtime die Meldungsserveradressliste durchgeht, um eine Verbindung herzustellen (bzw. erneut herzustellen). Der Wert -1 gibt an, dass die Anzahl der Versuche unbegrenzt ist.</p>
<p><b>Wiederherstellen der Verbindung zum Meldungsdienst aktivieren</b>: Der Wert <B>true</B> gibt an, dass die Client-Runtime versucht, eine erneute Verbindung zu einem Meldungsserver (oder zur Liste der Adressen in einer Meldungsserverliste) herzustellen, wenn eine Verbindung getrennt wird.<br>
</p>
<p><b>Anzahl der Versuche zum Wiederherstellen der Verbindung</b>: Gibt die Anzahl der Versuche zur Wiederherstellung einer Verbindung f&uuml;r die einzelnen in der Meldungsserveradressliste enthaltenen Addressen an, die vorgenommen werden, bevor die Client-Runtime mit der n&auml;chsten Adresse in der Liste fortf&auml;hrt. Der Wert -1 gibt an, dass die Anzahl der Versuche unbegrenzt ist.<br>
</p>
<p><b>Verz&ouml;gerung f&uuml;r Wiederherstellen der Verbindung zum Meldungsdienst (Millisek.)</b>: Gibt das Intervall (in Millisekunden) zwischen den Versuchen zur Wiederherstellung einer Verbindung f&uuml;r die einzelnen in der Meldungsserveradressliste enthaltenen Addressen an, bevor die Client-Runtime mit der jeweils n&auml;chsten Adresse in der Liste fortf&auml;hrt. Falls dieses Intervall zu kurz ist, verf&uuml;gt ein Broker nicht &uuml;ber gen&uuml;gend Zeit zur Wiederherstellung. Falls es zu lang ist, erf&auml;hrt die Verbindungswiederherstellung m&ouml;glicherweise eine nicht akzeptable Verz&ouml;gerung.<br>
</p>
<p><b>Verbindungs-Ping-Intervall (Sekunden)</b>:
 Gibt das minimale Intervall (in Sekunden) an, nach dem die Client-Runtime regelm&auml;&szlig;ig &uuml;berpr&uuml;ft, dass die Verbindung zum Broker in gutem Zustand ist.<br></p>
<p>&nbsp;</p>

</BODY>
</HTML>
