<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Eigenschaften Broker-Ziel &gt; Grundlagen</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Eigenschaften Broker-Ziel &gt; <BR>Grundlagen</H2>
 
<P>Auf dieser Registerkarte werden Informationen zum jeweiligen Broker-Ziel angezeigt, und Sie finden hier Optionen, mit denen Sie die Eigenschaften &auml;ndern k&ouml;nnen, die Sie im Dialogfeld <b>Broker-Ziel hinzuf&uuml;gen</b> f&uuml;r das jeweilige Ziel festgelegt haben.</P>

<p><b>Zielname</b>: Zeigt den Namen des physischen Ziels an.</p>
<p><b>Zieltyp</b>: Zeigt den Zieltyp an (<B>Warteschlange</B> oder <B>Thema</B>). </p>
<p><b>Zielstatus</b>: Gibt an, ob das Ziel aktiv oder unterbrochen ist (unterbrochene Produzenten, unterbrochene Konsumenten oder beides).</p>

<P>
<hr>
<p><b>Aktuelle Zahl Meldungen</b>: Gibt die Anzahl nicht konsumierter Meldungen an, die derzeit in diesem Ziel vorhanden sind.</p>
<p><b>Aktuelle Gesamtgr&ouml;&szlig;e Meldungen</b>: Gibt die Geamtgr&ouml;&szlig;e des Speichers an, der von den derzeit in diesem Ziel vorhandenen Meldungen belegt wird.</p>
<p><b>Aktuelle Zahl von Produzenten</b>: Gibt die Anzahl der Produzenten an, die derzeit mit diesem Ziel verkn&uuml;pft sind.</p>
<p><b>Aktuelle Zahl Konsumenten</b>: Gibt die Anzahl der Konsumenten an, die derzeit mit diesem Ziel verkn&uuml;pft sind. Hierzu z&auml;hlen nicht dauerhafte Elemente sowie aktive/inaktive dauerhafte Elemente (nur Thema).</p>
<p><b>Aktuelle Zahl aktiver Konsumenten</b>: Gibt die Anzahl der aktiven Konsumenten an, die derzeit mit diesem Ziel verkn&uuml;pft sind.</p>
<p><b>Aktuelle Zahl von Backup-Konsumenten</b>: Gibt die Anzahl der Backup-Konsumenten an, die derzeit mit diesem Ziel verkn&uuml;pft sind (nur Warteschlange).</p>
<P>
<hr>
<p><b>H&ouml;chstzahl Meldungen</b>: Gibt die maximale Anzahl nicht konsumierter Meldungen an, die in diesem Ziel zul&auml;ssig sind. </p>
<p><b>Gesamtgr&ouml;&szlig;e Meldungen</b>: Gibt den maximal zul&auml;ssigen Speicher an, der in diesem Ziel f&uuml;r nicht konsumierte Meldungen zul&auml;ssig ist. W&auml;hlen Sie in der Dropdown-Liste eine der folgenden Ma&szlig;einheiten aus: Byte, Kilobyte oder Megabyte.</p>
<p><b>Max. Meldungsgr&ouml;&szlig;e</b>: Legt fest, wie gro&szlig; eine einzelne Meldung in diesem Ziel maximal sein darf. W&auml;hlen Sie in der Dropdown-Liste eine der folgenden Ma&szlig;einheiten aus: Byte, Kilobyte oder Megabyte.</p>
<p><b>H&ouml;chstzahl von Produzenten</b>: Gibt die maximale Anzahl der in diesem Ziel zul&auml;ssigen Produzenten an.</p>
<p><b>H&ouml;chstzahl aktiver Konsumenten</b>: Gilt nur f&uuml;r Warteschlangenziele. Gibt die maximale Anzahl an Konsumenten an, die bei einer Zustellung mit Lastenausgleich von diesem Ziel aus aktiv sein d&uuml;rfen.</p>
<p><b>H&ouml;chstzahl von Backup-Konsumenten</b>: Gilt nur f&uuml;r Warteschlangenziele. Gibt die maximale Anzahl an Backup-Konsumenten an, die an die Stelle aktiver Konsumenten treten k&ouml;nnen, falls ein aktiver Konsument bei einer Zustellung mit Lastenausgleich von diesem Ziel aus fehlschlagen sollte.</p>
<P>
<hr>
<P><b>Verhalten bei Begrenzungen</b>: Gibt an, wie der Broker antwortet, wenn f&uuml;r dieses Ziel ein Schwellenwert f&uuml;r die Speicherbegrenzung erreicht wurde. Folgende Werte sind vorhanden: 
<UL>
  <li>FLOW_CONTROL - verlangsamt die Produzenten</li>
  <li>REMOVE_OLDEST - entfernt die &auml;ltesten Meldungen</li>
  <li>REMOVE_LOW_PRIORITY - entfernt Meldungen mit der niedrigsten Priorit&auml;t unter Ber&uuml;cksichtigung ihres Alters (produzierender Client erh&auml;lt keine Benachrichtigung &uuml;ber die L&ouml;schung der Meldungen)</li>  
  <li>REJECT_NEWEST - lehnt die neuesten Meldungen ab (dem produzierenden Client wird im Fall eines Ablehnens von persistenten Meldungen ein Ausnahmefehler gemeldet, bei der Ablehnung von nicht persistenten Meldungen erfolgt jedoch keine Benachrichtigung)</li>
  
</ul>

<p><b>Warteschlange f&uuml;r nicht zustellbare Meldungen</b> Gibt an, dass eine Warteschlange f&uuml;r nicht zustellbare Meldungen f&uuml;r das Ziel verwendet wird.</p>

<p>Wenn eine Meldung als nicht zustellbar eingestuft wird, wird sie automatisch in eine spezielle Warteschlange, die sogenannte Warteschlange f&uuml;r nicht zustellbare Meldungen gestellt. Eine Meldung, die in diese Warteschlange gestellt wurde, beh&auml;lt alle ihre urspr&uuml;nglichen Header (einschlie&szlig;lich ihres urspr&uuml;nglichen Ziels) bei und ihren Eigenschaften werden Informationen hinzugef&uuml;gt, die erl&auml;utern sollen, warum die Meldung als nicht zustellbar eingestuft wurde. Ein Administrator oder Entwickler kann auf diese Warteschlange zugreifen, eine Meldung entfernen und feststellen, warum sie in die Warteschlange gestellt wurde.</p>

<p>Die Warteschlange f&uuml;r nicht zustellbare Meldungen wird automatisch vom System erstellt und erh&auml;lt den Namen <code>mq.sys.dmq</code>.</p>

<hr>

<p><b>So l&ouml;schen Sie Meldungen aus einem Ziel:</b></p>
<ol>
  <li>W&auml;hlen Sie im Ergebnisbereich der Konsole das Ziel aus.</li>
  <li>W&auml;hlen Sie den Befehl <b>Aktionen &gt; Meldungen bereinigen</b>.</li>
</ol>
<p><b>So l&ouml;schen Sie ein Ziel:</b></p>
<ol>
  <li>W&auml;hlen Sie im Ergebnisbereich der Konsole das Ziel aus.</li>
  <li>W&auml;hlen Sie den Befehl <b>Bearbeiten &gt; L&ouml;schen</b>.</li>
</ol>
<p><b>So unterbrechen Sie ein Ziel:</b></p>
<ol>
  <li>W&auml;hlen Sie im Ergebnisbereich der Konsole das Ziel aus.</li>
  <li>W&auml;hlen Sie <b>Aktionen &gt; Produzenten unterbrechen | Konsumenten unterbrechen | Alle unterbrechen</b>.</li>
</ol>
<p><b>So nehmen Sie ein unterbrochenes Ziel wieder auf:</b></p>
<ol>
  <li>W&auml;hlen Sie im Ergebnisbereich der Konsole das Ziel aus.</li>
  <li>W&auml;hlen Sie den Befehl <b>Aktionen &gt; Fortsetzen</b>.</li>
</ol>
<p>&nbsp;</p>

</BODY>
</HTML>
