<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Dialogfeld &quot;Objektspeichereigenschaften&quot;</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 <H2>Dialogfeld &quot;Objektspeichereigenschaften&quot;</H2>
 
<P>Mit Hilfe dieses Dialogfelds k&ouml;nnen Sie Eigenschaften von Objektspeichern, die Sie bereits dem Navigationsbereich Ihrer Administratorkonsole hinzugef&uuml;gt haben, hinzuf&uuml;gen, l&ouml;schen oder aktualisieren.  Die Felder in diesem Dialogfeld k&ouml;nnen nur bearbeitet werden, wenn Sie zuvor die Verbindung zwischen Administrationskonsole und Objektspeicher trennen und dieses Dialogfeld dann erneut &ouml;ffnen.</P>

<P><b>Eigenschaften JNDI-Benennungsdienst</b>: Mit den Optionen in diesem Bereich k&ouml;nnen Sie die Liste der JNDI-Eigenschaften f&uuml;r diesen Objektspeicher definieren. W&auml;hlen Sie in der Dropdown-Liste <b>Name</b> einen Eigenschaftsnamen aus. Geben Sie anschlie&szlig;end im Feld <b>Wert</b> den Eigenschaftswert ein.</P>
<P> Informationen zur JNDI-API finden Sie unter <code>http://java.sun.com/products/jndi/1.2/javadoc/</code>. Sie m&uuml;ssen die Eigenschaften <code>java.naming.factory.initial</code> und <code>java.naming.provider.url</code> festlegen. </P>
<p>Die anf&auml;ngliche Kontexteigenschaft (<code>java.naming.factory.initial</code>) kann zwei Werte aufweisen:</p>
<ul> 
  <li> Dateisystemspeicher: <code>com.sun.jndi.fscontext.RefFSContextFactory</code></li>
  <li>LDAP-Server: <code>com.sun.jndi.ldap.LdapCtxFactory</code></li>
</ul>
<p>Dar&uuml;ber hinaus m&uuml;ssen Sie die Authentifizierungsinformationen eingeben. Wenn Ihnen das nicht sicher genug ist, sollten Sie mit der Eingabe dieser Informationen warten, bis Sie beim Verbindungsaufbau dazu aufgefordert werden.</p>
<ul>
  <li> Klicken Sie nach dem Eingeben des Namens und des Wertes f&uuml;r die Eigenschaft auf <b>Hinzuf&uuml;gen</b>, um der Tabelle die Eigenschaft hinzuzuf&uuml;gen.</li>
  <li> Wenn Sie eine bestehende Eigenschaft wieder l&ouml;schen m&ouml;chten, w&auml;hlen Sie die entsprechende Eigenschaft in der Tabelle aus und klicken Sie dann auf <b>L&ouml;schen</b>. </li>
  <li>Wenn alle Eintr&auml;ge gel&ouml;scht werden sollen, klicken Sie auf <b>Alle l&ouml;schen</b>. </li>
  <li>Wenn Sie eine Eigenschaft &auml;ndern m&ouml;chten, w&auml;hlen Sie den entsprechenden Eintrag aus, &auml;ndern Sie dessen Wert und klicken Sie dann auf <b>&Auml;ndern</b>. </li>
  <li>Klicken Sie auf <b>OK</b>, um alle Eigenschafts&auml;nderungen wirksam werden zu lassen. </li>
</ul>

<p>So stellen Sie nach dem &Auml;ndern der Objektspeichereigenschaften die Verbindung zum Objektspeicher wieder her: W&auml;hlen Sie im Navigationsbereich den Objektspeicher aus und w&auml;hlen Sie den Befehl <b>Aktionen &gt; Verbinden mit Objektspeicher</b>. </p>

<P>&nbsp;</P>
</BODY>
</HTML>
