<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>&Uuml;bersicht</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H1>&Uuml;berblick</H1>
 
<P> Mit Hilfe der Steuerelemente der Administrationskonsole k&ouml;nnen Sie mit einem oder mehreren Message Queue-Brokern und Objektspeichern kommunizieren.</P>
<P>Die Administrationskonsole ist in f&uuml;nf Bereiche unterteilt (siehe Abbildung).</P>
<P><img src="../images/console.gif" alt="Darstellung der Administrationskonsole mit ihren f&uuml;nf Bereichen"></P>
<UL>
<LI>1 - Men&uuml;leiste
<LI>2 - Symbolleiste
<LI>3 - Navigationsbereich
<LI>4 - Ergebnisbereich
<LI>5 - Statusbereich
</UL>
<P>Mit Hilfe der Men&uuml;s in der <b>Men&uuml;leiste</b> oder der Symbolschaltfl&auml;chen in der <b>Symbolleiste</b> k&ouml;nnen Sie auf die im <b>Navigationsbereich</b> und im <b>Ergebnisbereich</b> ausgew&auml;hlten Elemente zugreifen und diese bearbeiten.
  
  Im <b>Statusbereich</b> finden Sie Informationen &uuml;ber die zuletzt ausgef&uuml;hrte Aktion.</P>
<P>Der Navigationsbereich enth&auml;lt eine als Strukturbaum dargestellte Ansicht der Objektspeicher und Broker, mit denen Sie verbunden sind. Objektspeicher enthalten verwaltete Objekte, wie Ziele (Typ <B>Warteschlange</B> oder <B>Thema</B>) oder Verbindungs-Factories. Broker enthalten eine Zusammenstellung von Diensten und physischen Zielen.</P>
<ul>
  <li>Wenn Sie sich die Ziele in einem Objektspeicher anzeigen lassen m&ouml;chten, klicken Sie auf den Ordner <b>Ziele</b>. Im Ergebnisbereich wird daraufhin der Inhalt dieses Ordners angezeigt.</li>
  <li>Wenn Sie sich Informationen &uuml;ber die Verbindungs-Factories in einem Objektspeicher anzeigen lassen m&ouml;chten, klicken Sie auf den Ordner <b>Verbindungs-Factories</b>. Im Ergebnisbereich werden daraufhin der Suchname und der Typ der einzelnen Verbindungs-Factories angezeigt.</li>
  <li>Wenn Sie sich die auf einem Broker verf&uuml;gbaren Dienste anzeigen lassen m&ouml;chten, klicken Sie auf den Ordner <b>Dienste</b>. Im Ergebnisbereich wird daraufhin eine Liste der Dienste mit Anschlussnummer und Status angezeigt.</li>
  <li>Wenn Sie sich Informationen &uuml;ber einen bestimmten Dienst anzeigen lassen oder diese &auml;ndern m&ouml;chten, w&auml;hlen Sie im Ergebnisbereich den jeweiligen Dienst aus und klicken Sie auf <b>Aktionen &gt; Eigenschaften</b>.</li>
  <li>Wenn Sie sich Informationen zu den physischen Zielen auf einem Broker anzeigen lassen m&ouml;chten, klicken Sie auf den Ordner <b>Ziele</b>. Daraufhin wird eine Liste der auf diesem Broker erstellten Ziele angezeigt, der Sie den Typ und, bei Warteschlangen, das Zustellungsverfahren entnehmen k&ouml;nnen. </li>
  <li>Wenn Sie sich Informationen &uuml;ber ein bestimmtes Ziel anzeigen lassen oder diese &auml;ndern m&ouml;chten, w&auml;hlen Sie das jeweilige Ziel im Ergebnisbereich aus und klicken Sie auf <b>Aktionen &gt; Eigenschaften</b>.</li>
</ul>
<P>Um die Eigenschaften eines Objektspeichers oder eines Brokers &auml;ndern zu k&ouml;nnen, m&uuml;ssen Sie die Verbindung trennen.</P>
<P>&Uuml;ber die grafische Benutzeroberfl&auml;che der Administrationskonsole haben Sie Zugriff auf die grundlegenden Funktionen zur Message Queue-Verwaltung. Mit Hilfe des entsprechenden Message Queue-Befehlsprogramms k&ouml;nnen Sie jedoch auf eine viel gr&ouml;&szlig;ere Zahl von Funktionen zugreifen. Weitere Informationen finden Sie im <i> 6.0 Administrator&rsquo;s Guide</i>.</P>
</BODY>
</HTML>
