<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2000-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at packager/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=UTF-8">
 <TITLE>object store properties</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 <H2>Propriet&agrave; dell'archivio degli oggetti</H2>
 
<P>Utilizzare questa finestra di dialogo per aggiungere, eliminare o aggiornare le propriet&agrave; di un archivio degli oggetti gi&agrave; aggiunto al riquadro di navigazione nella console di amministrazione. Per modificare i campi di questa finestra di dialogo, &egrave; necessario disconnettere la console di amministrazione dall'archivio degli oggetti, quindi visualizzare nuovamente la finestra di dialogo.</P>

<P><b>Propriet&agrave; del servizio di denominazione JNDI</b>: utilizzare i controlli in questa sezione per definire l'elenco delle propriet&agrave; JNDI per questo archivio degli oggetti. Utilizzare l'elenco a discesa <b>Nome</b> per selezionare un nome di propriet&agrave;. Dopo avere selezionato il nome della propriet&agrave;, utilizzare il campo <b>Valore</b> per inserire il valore della propriet&agrave;.</P>
<P> Vedere <code>http://java.sun.com/products/jndi/1.2/javadoc/</code> per informazioni sull'interfaccia di programmazione dell'applicazione JNDI. &Egrave; necessario impostare le propriet&agrave; 
  <code>java.naming.factory.initial e java.naming.provider.url</code> 
  . </P>
<p>La propriet&agrave; di contesto iniziale (<code>java.naming.factory.initial</code>) pu&ograve; essere associata a due valori:</p>
<ul> 
  <li> Archivio file system: <code>com.sun.jndi.fscontext.RefFSContextFactory</code></li>
  <li>Server LDAP: <code>com.sun.jndi.ldap.LdapCtxFactory</code></li>
</ul>
<p>Inoltre, &egrave; necessario specificare le informazioni di autenticazione. Tuttavia, se la sicurezza &egrave; una priorit&agrave;, &egrave; possibile attendere la visualizzazione di un messaggio che richiede tali informazioni al momento della connessione.</p>
<ul>
  <li> Dopo aver specificato il nome e il valore della propriet&agrave;, fare clic sul pulsante <b>Aggiungi</b> per aggiungere la propriet&agrave; alla tabella.</li>
  <li> Per eliminare una propriet&agrave; esistente, selezionare la propriet&agrave; nella tabella, quindi fare clic sul pulsante <b>Elimina</b> per eliminare la propriet&agrave; selezionata. </li>
  <li>Utilizzare il pulsante <b>Cancella</b> per eliminare tutte le voci. </li>
  <li>Selezionare una voce, modificarne il valore e utilizzare il pulsante <b>Modifica</b> per riconfigurare la propriet&agrave;. </li>
  <li>Utilizzare il pulsante <b>OK</b> per eseguire il commit di tutte le impostazioni della propriet&agrave;. </li>
</ul>

<p>Per eseguire la riconnessione all'archivio degli oggetti dopo averlo riconfigurato: selezionare l'archivio degli oggetti nel riquadro di navigazione e scegliere <b>Azioni &gt; Connetti ad archivio degli oggetti</b>. </p>

<P>&nbsp;</P>
</BODY>
</HTML>
