<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<html>
<head>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <title>Agregar f&aacute;brica de conexi&oacute;n</title>
 <link rel="StyleSheet" href="ide.css">
 
</head>
<body>
 <h2>Agregar objeto de f&aacute;brica de conexi&oacute;n</h2>
 
<p>Use este di&aacute;logo para configurar un objeto de f&aacute;brica de conexi&oacute;n y agregarlo a un almac&eacute;n de objetos.</p>

<p>Las <i>f&aacute;bricas de conexi&oacute;n</i> son objetos administrados que utilizan los clientes JMS para conectar con el agente. Este objeto se usa tambi&eacute;n para especificar el comportamiento de la conexi&oacute;n y el tipo de acceso al agente del motor de ejecuci&oacute;n cliente que lo utiliza.</p>

<p><b>Nombre de b&uacute;squeda</b> Use este campo para especificar el nombre de b&uacute;squeda JNDI del objeto de f&aacute;brica de conexi&oacute;n. </p>

<p><b>Tipo de f&aacute;brica</b> Elija el elemento de men&uacute; que especifica el tipo de conexiones que produce la f&aacute;brica: ConnectionFactory, QueueConnectionFactory o TopicConnectionFactory. Si el mensaje debe formar parte de una transacci&oacute;n distribuida, elija XAConnectionFactory, XAQueueConnectionFactory o XATopicConnectionFactory.</p>

<p><b>S&oacute;lo lectura</b> Haga clic en esta casilla de verificaci&oacute;n para que el objeto de f&aacute;brica de conexi&oacute;n sea de s&oacute;lo lectura. Si el objeto es de s&oacute;lo lectura, las aplicaciones cliente no podr&aacute;n modificar sus atributos mediante llamadas de API. </p>

<p>Al configurar un objeto de f&aacute;brica de conexi&oacute;n se especifican las propiedades comunes a todas las conexiones que produce la f&aacute;brica. Utilice las fichas mostradas en el di&aacute;logo para configurar la f&aacute;brica de conexi&oacute;n. Haga clic en uno de los enlaces siguientes para m&aacute;s informaci&oacute;n sobre una ficha determinada.</p>

	
<a HREF="add_connfact_rel.htm">Confiabilidad de mensajes JMS y controles de flujo</a> <br> <a HREF="add_connfact_queue.htm">QueueBrowsers y ServerSessions</a><br> <a HREF="add_connfact_handling.htm">Gesti&oacute;n de conexiones</a><br> <a HREF="add_connfact_clientid.htm">Identificaci&oacute;n de cliente</a> <br> <a HREF="add_connfact_jmsx.htm">Propiedades de JMSX</a> <br> <a HREF="add_connfact_message_header_overrides.htm">Valores de reemplazo de los encabezados de mensaje JMS</a><br> <a HREF="add_connfact_handling_old.htm">Gesti&oacute;n de conexiones 3.0</a><br>
  	 

<ul>
  <li>Haga clic en el bot&oacute;n <b>Usar valores predeterminados</b> para usar el valor predeterminado en todos los campos de todas las fichas del di&aacute;logo. </li>
  <li> Haga clic en <b>Aceptar</b> para crear el objeto de f&aacute;brica de conexi&oacute;n. </li>
</ul>

<p>Para cambiar las propiedades de un objeto de f&aacute;brica de conexi&oacute;n:</p>

<ol>
  <li>Seleccione la carpeta F&aacute;bricas de conexi&oacute;n en el panel de navegaci&oacute;n de la consola de administraci&oacute;n. </li>
  <li>Seleccione el objeto de f&aacute;brica de conexi&oacute;n en el panel de resultados de la consola de administraci&oacute;n. </li>
  <li>Elija <b>Acciones &gt; Propiedades</b> para abrir el di&aacute;logo Propiedades del objeto de f&aacute;brica de conexi&oacute;n. </li>
</ol>

<p>&nbsp;</p>

</body>
</html>
