<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<html>
<head>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <title>Agregar almac&eacute;n de objetos</title>
 <link rel="StyleSheet" href="ide.css">
 
</head>
<body>
<h2>Agregar almac&eacute;n de objetos</h2>
<p>Use este di&aacute;logo para agregar un almac&eacute;n de objetos existente al panel de navegaci&oacute;n de su herramienta de administraci&oacute;n. Despu&eacute;s de agregar el almac&eacute;n, puede conectarse a &eacute;l y agregarle objetos de destino y objetos de f&aacute;brica de conexi&oacute;n. </p>
<p>Un <i>almac&eacute;n de objetos</i> contiene los objetos administrativos que usted crea: <i>objetos de destino</i> y <i>objetos de f&aacute;brica de conexi&oacute;n</i>. Su contenido es accesible mediante c&oacute;digo est&aacute;ndar de b&uacute;squeda JNDI ejecutado por la aplicaci&oacute;n cliente. Un almac&eacute;n de objetos puede estar basado en archivos o ser un servidor LDAP. Si desea utilizar un almac&eacute;n basado en archivos, deber&aacute; crear una carpeta para el mismo. Si desea usar un servidor LDAP, tendr&aacute; que configurar e iniciar el servidor. </p>
<p><b>Etiqueta del almac&eacute;n de objetos</b>: Especifica el nombre del almac&eacute;n de objetos. Este nombre aparecer&aacute; en el panel de navegaci&oacute;n de la consola de administraci&oacute;n.</p>
<p><b>Propiedades del servicio de nombres JNDI</b>: Use los controles de esta &aacute;rea para definir la lista de propiedades JNDI para este almac&eacute;n de objetos. Use la lista desplegable <b>Nombre</b> para seleccionar un nombre de propiedad. Despu&eacute;s de seleccionar el nombre de propiedad, use el campo <b>Valor</b> para escribir el valor de la propiedad.</p>
<p> Consulte <code>http://java.sun.com/products/jndi/1.2/javadoc/</code> para obtener informaci&oacute;n acerca de la interfaz de programaci&oacute;n de aplicaciones JNDI. Deber&aacute; definir las propiedades <code>java.naming.factory.initial y java.naming.provider.url</code>. </p>
<p>La propiedad de contexto inicial (<code>java.naming.factory.initial</code>) puede tener dos valores:</p>
<ul>
  <li>Almac&eacute;n del sistema de archivos: <code>com.sun.jndi.fscontext.RefFSContextFactory</code></li>
  <li>Servidor LDAP: <code>com.sun.jndi.ldap.LdapCtxFactory</code></li>
</ul>
<p>Tambi&eacute;n deber&aacute; especificar la informaci&oacute;n de autenticaci&oacute;n. Sin embargo, si le preocupa la seguridad, puede esperar a que se le pida dicha informaci&oacute;n en el momento de la conexi&oacute;n.</p>

<ul>
  <li>Despu&eacute;s de especificar el nombre de propiedad y su valor, haga clic en el bot&oacute;n <b>Agregar</b> para agregar la propiedad a la tabla.</li>
  <li>Para eliminar una propiedad existente, selecci&oacute;nela en la tabla y haga clic en el bot&oacute;n <b>Eliminar</b> para eliminarla.</li>
  <li>Use el bot&oacute;n <b>Borrar</b> para borrar todas las entradas.</li>
  <li>Para reconfigurar una propiedad, seleccione la propiedad que desee, cambie sus valores y use el bot&oacute;n <b>Cambiar</b> para reconfigurarla.</li>
  <li>Use el bot&oacute;n <b>Aceptar</b> para confirmar los valores de la propiedad y agregar el almac&eacute;n de objetos.</li>
</ul>
<p>Para cambiar las propiedades de un almac&eacute;n de objetos existente, haga lo siguiente: 
</p>

<ol>
  <li>Descon&eacute;ctese del almac&eacute;n de objetos si a&uacute;n no lo ha hecho. Un almac&eacute;n de objetos est&aacute; desconectado si su icono en el panel de navegaci&oacute;n tiene este aspecto: <img src="../images/ObjectStoreX16X.gif" alt="Icono de almac&eacute;n de objetos con una X superpuesta"><br> Para desconectarse de un almac&eacute;n de objetos, seleccione el almac&eacute;n en el panel de navegaci&oacute;n y elija <b>Acciones &gt; Desconectar del almac&eacute;n de objetos.</b> </li>
  <li>Elija <b>Acciones &gt; Propiedades</b> para abrir el di&aacute;logo Propiedades del almac&eacute;n de objetos.</li>
</ol>

<p>Para agregar un objeto de destino al almac&eacute;n de objetos, haga clic en la carpeta Destinos y elija <b>Acciones &gt; Agregar objeto de destino</b>. </p>

<p>Para agregar una f&aacute;brica de conexi&oacute;n al almac&eacute;n de objetos, haga clic en la carpeta F&aacute;brica de conexi&oacute;n y elija <b>Acciones &gt; Agregar objeto de f&aacute;brica de conexi&oacute;n. </b></p>

<p>&nbsp;</p>

</body>
</html>
