<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Agregar objeto de destino</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Agregar objeto de destino</H2>
 
<P>Use este di&aacute;logo para agregar un objeto de destino a un almac&eacute;n de objetos. </P>

<P>Un <i>objeto administrado de destino</i> es una representaci&oacute;n independiente del proveedor de un destino f&iacute;sico (una cola o un tema) en un agente. </P>

<P><b>Nombre de b&uacute;squeda</b> Use este campo para especificar el nombre de b&uacute;squeda JNDI del objeto administrado. Este nombre puede ser el mismo que el nombre del destino; la &uacute;nica restricci&oacute;n es que debe ser &uacute;nico en el contexto del almac&eacute;n de objetos. </P>

<P><b>Tipo de destino</b> Haga clic en el bot&oacute;n de radio que corresponde al tipo de destino: cola o tema. </P>

<P><b>S&oacute;lo lectura</b> Haga clic en esta casilla de verificaci&oacute;n para que el objeto sea de s&oacute;lo lectura. Si el objeto es de s&oacute;lo lectura, las aplicaciones cliente no podr&aacute;n modificar los atributos de objetos administrados mediante llamadas de API. </P>

<P><b>Nombre del destino</b> Use este campo para especificar el nombre del destino f&iacute;sico en el agente al que corresponde este objeto administrado. Si no lo especifica, se usar&aacute; el nombre predeterminado de <code>Untitled_Destination_Object</code>. </P>

<P><b>Descripci&oacute;n del destino</b> Use este campo para indicar una descripci&oacute;n &uacute;til de este objeto de destino.</P>

<ul>
  <li>Haga clic en el bot&oacute;n <b>Usar valores predeterminados</b> para usar el valor predeterminado en todos los campos. </li>
  <li> Haga clic en <b>Aceptar</b> para crear el objeto de destino. </li>
</ul>

<p>Para cambiar las propiedades de un objeto de destino: </p>

<ol>
  <li>Seleccione la carpeta Destinos en el panel de navegaci&oacute;n de la consola de administraci&oacute;n. </li>
  <li>Seleccione el objeto de destino en el panel de resultados de la consola de administraci&oacute;n. </li>
  <li>Elija <b>Acciones &gt; Propiedades</b> para abrir el di&aacute;logo Propiedades del objeto de destino. </li>
</ol>

<P>&nbsp;</P>

</BODY>
</HTML>
