<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Agregar identificaci&oacute;n de cliente de una f&aacute;brica de conexi&oacute;n</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Agregar objeto de f&aacute;brica de conexi&oacute;n &gt; <BR>Identificaci&oacute;n de cliente</H2>
 
<P>Utilice esta ficha para especificar los valores predeterminados de nombre de usuario y contrase&ntilde;a, as&iacute; como para indicar la forma en que se identificar&aacute; un cliente (ClientID) ante un agente. Los valores de ClientID se usan principalmente para llevar un seguimiento de las suscripciones duraderas.</P>

<P><b>Nombre de usuario predeterminado</b> Especifica el nombre de usuario que se utilizar&aacute; de forma predeterminada para autenticarse ante el agente. El valor predeterminado es <code>guest</code>.</P>
<p><b>Contrase&ntilde;a predeterminada</b> Especifica la contrase&ntilde;a que se utilizar&aacute; de forma predeterminada para autenticarse ante el agente. El valor predeterminado es <code>guest</code>.</p>
<p><b>Desactivar API JMS para setClientID()</b> Especifica que la aplicaci&oacute;n cliente no puede usar llamadas a API para cambiar el valor ClientID. Esto supone una ventaja para el administrador, ya que le permite controlar la asignaci&oacute;n de los ClientID.</p>
<p> Si activa esta casilla, puede usar el campo <b>Configurar ClientID como</b> para especificar una identificaci&oacute;n de cliente. Si no lo especifica, el sistema asignar&aacute; un valor predeterminado compuesto por la direcci&oacute;n IP del host del cliente. Si bien ello se hace para comodidad de los programadores, impide que una aplicaci&oacute;n cliente pueda crear m&aacute;s de una conexi&oacute;n: el sistema no permite dos conexiones con un mismo valor de ClientID.</p>
<p><b>Configurar ClientID como</b> Especifica un identificador de cliente. Si no especifica este valor y deshabilit&oacute; la llamada a API que define el Id. de cliente, el sistema asignar&aacute; un valor predeterminado con la direcci&oacute;n IP del host del cliente. Si bien ello se hace para comodidad de los programadores, impide que una aplicaci&oacute;n cliente pueda crear m&aacute;s de una conexi&oacute;n: el sistema no permite dos conexiones con un mismo valor de ClientID.</p>
<p>&nbsp;</p>

</BODY>
</HTML>
