<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Agregar control de la f&aacute;brica de conexi&oacute;n</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
<H2>Agregar objeto de f&aacute;brica de conexi&oacute;n &gt; <BR> Gesti&oacute;n de conexiones</H2>
<p>Use la ficha &quot;Gesti&oacute;n de conexiones&quot; para configurar las conexiones que se crear&aacute;n mediante esta f&aacute;brica.</p>
<p><b>Lista de direcciones del servidor de mensajes</b> Especifica una lista de direcciones del servidor de mensajes (una o varias), separadas por comas, cada una de las cuales corresponde a una instancia diferente del agente a la que se puede conectar el motor de ejecuci&oacute;n cliente. Cada una de las direcciones de la lista incluye el nombre y el puerto del host y el servicio de conexi&oacute;n para efectuar la conexi&oacute;n. <br>Para obtener m&aacute;s informaci&oacute;n acerca de la sintaxis de las direcciones del servidor de mensajes, <a href="message_server_syntax.htm">haga clic aqu&iacute;</a><br>
</p>
<p><b>Orden de la lista de direcciones</b> Especifica si los intentos para establecer una conexi&oacute;n se realizan en el orden en que aparecen las direcciones en la lista del servidor de mensajes (PRIORIDAD) o en un orden aleatorio (ALEATORIO). Si varios clientes intentan conectarse usando la misma f&aacute;brica de conexi&oacute;n, puede establecer un orden aleatorio para evitar que se conecten todos a la misma direcci&oacute;n.<br>
</p>
<p><b>N&uacute;mero de intentos en la lista de direcciones</b> Especifica el n&uacute;mero de veces que el motor de ejecuci&oacute;n cliente intentar&aacute; establecer (o restablecer) una conexi&oacute;n en la lista de direcciones del servidor. El valor -1 indica que el n&uacute;mero de intentos es ilimitado.</p>
<p><b>Activar reconexi&oacute;n con el servicio de mensajes</b> Si su valor es verdadero, el motor de ejecuci&oacute;n cliente podr&aacute; intentar reconectarse a un servidor de mensajes (o a la lista de direcciones, en el caso de una lista de servidor de mensajes) cuando se pierda una conexi&oacute;n.<br>
</p>
<p><b>N&uacute;mero de intentos de reconexi&oacute;n</b> Especifica el n&uacute;mero de intentos de reconexi&oacute;n para cada direcci&oacute;n de la lista de direcciones del servidor de mensajes antes de que el motor de ejecuci&oacute;n cliente avance a la siguiente direcci&oacute;n de la lista. El valor -1 indica que el n&uacute;mero de intentos es ilimitado.<br>
</p>
<p><b>Retraso de reconexi&oacute;n con el servicio de mensajes (miliseg.)</b> Especifica el retraso (en milisegundos) entre los intentos de reconexi&oacute;n para cada direcci&oacute;n de la lista de direcciones del servidor de mensajes antes de que el motor de ejecuci&oacute;n cliente avance a la siguiente direcci&oacute;n de la lista. Si el intervalo es demasiado corto, el agente no podr&aacute; recuperarse. Si es demasiado largo, la reconexi&oacute;n puede suponer un retraso inaceptable.<br>
</p>
<p><b>Intervalo de pulso de sondeo de conexi&oacute;n (segundos)</b> Especifica el intervalo m&iacute;nimo (en segundos) en el que el motor de ejecuci&oacute;n cliente comprobar&aacute; peri&oacute;dicamente que su conexi&oacute;n con el agente es buena.<br>
</p>
<p>&nbsp;</p>

</BODY>
</HTML>
