<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Agregar destino de agente</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 <H2>Agregar destino de agente</H2>

<P>Use este cuadro de di&aacute;logo para crear y configurar un destino f&iacute;sico en el agente. El <i>destino</i> del agente es una ubicaci&oacute;n en la memoria f&iacute;sica del mismo en donde los mensajes entrantes se empaquetan (marshaled) antes de enrutarlos a los consumidores de mensajes. </P>
<P>La mensajer&iacute;a Message Queue se implementa como una entrega de mensajes en dos fases: en primer lugar, el mensaje se env&iacute;a desde un productor a un <i>destino</i> del agente; en segundo lugar, el mensaje se env&iacute;a desde ese destino a uno o m&aacute;s consumidores. </P>
<P>Un agente se puede configurar para que cree de forma din&aacute;mica destinos f&iacute;sicos, en caso de que usted no los haya creado. Estos destinos creados autom&aacute;ticamente son destruidos por el agente cuando ya no se necesitan.</P>
<P>Para configurar un destino f&iacute;sico, defina los siguientes valores de atributos:</P>
<P><b>Nombre del destino</b> Especifica el nombre del destino f&iacute;sico.</P>
<P><b>Tipo de destino</b> Especifica el tipo de destino (cola o tema). Haga clic en el bot&oacute;n de radio <b>Cola</b> o <b>Tema</b>. </P>

<P><b>N&uacute;mero m&aacute;x. de mensajes</b> Especifica el n&uacute;mero m&aacute;ximo de mensajes no consumidos que se permite en este destino. </P>
<p><b>Tama&ntilde;o m&aacute;x. total de mensajes (bytes)</b> Especifica la cantidad m&aacute;xima total de memoria que se permite en este destino para mensajes no consumidos. Utilice la lista desplegable para seleccionar la unidad de medida: bytes, kilobytes o megabytes.</p>
<p><b>Tama&ntilde;o m&aacute;x. por mensaje (bytes)</b> Especifica el tama&ntilde;o m&aacute;ximo de cada mensaje que se permite en este destino. Utilice la lista desplegable para seleccionar la unidad de medida: bytes, kilobytes o megabytes.</p>
<p><b>N&uacute;mero m&aacute;ximo de productores</b> Especifica el n&uacute;mero m&aacute;ximo de productores que se permite en este destino.</p>
<p><b>N&uacute;mero m&aacute;ximo de consumidores activos</b> Se aplica s&oacute;lo a los destinos de cola. Especifica el n&uacute;mero m&aacute;ximo de consumidores que puede estar activo en una entrega de carga equilibrada desde este destino.</p>
<p><b>N&uacute;mero m&aacute;ximo de consumidores de respaldo</b> Se aplica s&oacute;lo a los destinos de cola. Especifica el n&uacute;mero m&aacute;ximo de consumidores de respaldo que puede ocupar el lugar de los consumidores activos en caso de que uno de estos &uacute;ltimos falle durante una entrega de carga equilibrada desde este destino.</p>
<P><b>Para obtener informaci&oacute;n del estado actual de un destino o cambiar las propiedades de un destino</b></P>
<ol>
  <li>Seleccione el destino en el panel de resultados de la consola.</li>
  <li>Elija <b>Acciones &gt; Propiedades</b>.</li>
</ol>
<P><b>Para depurar los mensajes en un destino:</b></P>
<ol>
  <li>Seleccione el destino en el panel de resultados de la consola.</li>
  <li>Elija <b>Acciones &gt; Depurar mensajes</b>.</li>
</ol>
<p><b>Para eliminar un destino:</b></p>
<ol>
  <li>Seleccione el destino en el panel de resultados de la consola.</li>
  <li>Elija <b>Editar &gt; Eliminar</b>.</li>
</ol>
<p><b>Para detener en pausa un destino:</b></p>
<ol>
  <li>Seleccione el destino en el panel de resultados de la consola.</li>
  <li>Elija <b>Acciones &gt; Detener en pausa a los productores | Detener en pausa a los consumidores | Detenerlos en pausa a todos</b>.</li>
</ol>
<p><b>Para reanudar un destino detenido en pausa:</b></p>
<ol>
  <li>Seleccione el destino en el panel de resultados de la consola.</li>
  <li>Elija <b>Acciones &gt; Reanudar</b>.</li>
</ol>
<p>&nbsp;</p>

</BODY>
</HTML>
