<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<html>
<head>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <title>agregar agente</title>
 <link rel="StyleSheet" href="ide.css">
</head>
<body>
 <h2>Agregar agente</h2>
 
<p>Use este di&aacute;logo para crear una representaci&oacute;n de un agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n. No es necesario iniciar el agente para ello. Deber&aacute; iniciarlo si desea conectarse a &eacute;l.</p>

<p><b>Etiqueta de agente</b> Especifica el nombre que desea que lleve este agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n. Este nombre no tiene por qu&eacute; ser el mismo que el nombre de instancia del agente.</p>

<p><b>Host</b> Especifica el nombre del equipo que aloja este agente. Tambi&eacute;n puede mostrar el valor predeterminado <code>localhost</code>.</p>

<p><b>Puerto primario</b> Especifica el n&uacute;mero del puerto asignado al asignador de puertos. De forma predeterminada, &eacute;ste es 7676. La combinaci&oacute;n de nombre de host y n&uacute;mero de puerto primario identifica de manera &uacute;nica al agente. Para poder ejecutar dos instancias de un agente en un mismo servidor, el asignador de puertos de cada una de ellas debe tener distinto n&uacute;mero de puerto.</p>

<p><b>Nombre de usuario</b> Especifica su nombre de usuario. De forma predeterminada, &eacute;ste es <code>admin</code> para el administrador. Esta informaci&oacute;n se usa para autenticarle cuando intente conectar con el agente. Este paso no es seguro. Si le preocupa la seguridad, debe esperar hasta el momento de la conexi&oacute;n, en que se le pedir&aacute; esta informaci&oacute;n.</p>

<p><b>Contrase&ntilde;a</b> Especifica su contrase&ntilde;a. De forma predeterminada<code>admin</code> para el administrador. Esta informaci&oacute;n se usa para autenticarle cuando intente conectar con el agente. Este paso no es seguro. Si le preocupa la seguridad, debe esperar hasta el momento de la conexi&oacute;n, en que se le pedir&aacute; esta informaci&oacute;n.</p>

<ul>
<li>Use el bot&oacute;n <b>Aceptar</b> para confirmar la informaci&oacute;n introducida y agregar el agente.
</ul>
<p>Para conectar con el agente agregado:</p>

<ol>
  <li>Seleccione el agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n.</li>
  <li>Elija <b>Acciones &gt; Conectar con agente</b>.</li>
</ol>

<p>Para consultar y/o actualizar un agente en ejecuci&oacute;n:</p>

<ol>
  <li>Seleccione el agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n.</li>
  <li>Con&eacute;ctese a &eacute;l si a&uacute;n no lo ha hecho.
  <li>Elija <b>Acciones &gt; Consultar/Actualizar agente</b>.</li>
</ol>

<p>Para cambiar la informaci&oacute;n indicada en este cuadro de di&aacute;logo para un agente particular, haga lo siguiente: </p>

<ol>
  <li>Seleccione el agente en el panel de navegaci&oacute;n.</li>
  <li>Descon&eacute;ctese del agente si a&uacute;n no lo ha hecho. Un agente est&aacute; desconectado si su icono en el panel de navegaci&oacute;n tiene este aspecto: <img src="../images/BrokerX16X.gif" alt="icono de agente con una X superpuesta"><br> Para desconectar un agente, elija <b>Acciones &gt; Desconectar de agente</b></li>
  <li>Elija <b>Acciones &gt; Propiedades</b> para abrir el cuadro de di&aacute;logo Propiedades del agente.</li>
</ol>

<p>&nbsp;</p>

</body>
</html>
