<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Informaci&oacute;n del agente</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Propiedades del agente</H2>
 
<P>Use este di&aacute;logo para cambiar la representaci&oacute;n de un agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n. No es necesario iniciar el agente para ello. Para editar los campos del di&aacute;logo, desconecte la consola del agente y vuelva a abrir de nuevo el di&aacute;logo. </P>

<p><b>Etiqueta de agente</b> Especifica el nombre que desea que lleve este agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n. Este nombre no tiene por qu&eacute; ser el mismo que el nombre de instancia del agente.</p>

<p><b>Host</b> Especifica el nombre del equipo que aloja este agente. Tambi&eacute;n puede mostrar el valor predeterminado localhost.</p>

<p><b>Puerto primario</b> Especifica el n&uacute;mero del puerto asignado al asignador de puertos. La combinaci&oacute;n de nombre de host y n&uacute;mero de puerto primario identifica de manera &uacute;nica al agente. Para poder ejecutar dos instancias de un agente en un mismo servidor, el asignador de puertos de cada una de ellas debe tener distinto n&uacute;mero de puerto.</p>

<p><b>Nombre de usuario</b> Especifica su nombre de usuario. De forma predeterminada, &eacute;ste es <code>admin</code> para el administrador. Esta informaci&oacute;n se usa para autenticarle cuando intente conectar con el agente. Este paso no es seguro. Si le preocupa la seguridad, debe esperar hasta el momento de la conexi&oacute;n, en que se le pedir&aacute; esta informaci&oacute;n.</p>

<p><b>Contrase&ntilde;a</b> Especifica su contrase&ntilde;a. De forma predeterminada, &eacute;ste es <code>admin</code> para el administrador. Esta informaci&oacute;n se usa para autenticarle cuando intente conectar con el agente. Este paso no es seguro. Si le preocupa la seguridad, debe esperar hasta el momento de la conexi&oacute;n, en que se le pedir&aacute; esta informaci&oacute;n.</p>
<p>Para volver a conectar con el agente:</p>

<ol>
  <li>Seleccione el agente en el panel de navegaci&oacute;n de la consola de administraci&oacute;n.</li>
  <li>Elija <b>Acciones &gt; Conectar con agente</b>.</li>
</ol>

<p>&nbsp;</p>

</BODY>
</HTML>
