<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Consultar/Actualizar agente - B&aacute;sicas</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Consultar/Actualizar agente &gt; <BR> B&aacute;sicas</H2>
 
<P>Use esta ficha para especificar o examinar la informaci&oacute;n de configuraci&oacute;n b&aacute;sica de una instancia de agente.</P>

<P><b>Versi&oacute;n</b> Especifica la versi&oacute;n del agente.</P>

<P><b>Nombre de instancia</b> Especifica el nombre predeterminado <code>imqbroker</code> o del nombre que asignara al iniciar el agente.</P>

<P><b>Puerto primario</b> Especifica el n&uacute;mero del puerto del asignador de puertos del agente. El asignador de puertos se ocupa de asignar puertos din&aacute;micamente a los servicios Message Queue. Debe ser el mismo n&uacute;mero que indic&oacute; al iniciar el agente.</P>

<P><b>Crear temas autom&aacute;ticamente</b> Especifica si el agente puede crear un destino de tema cada vez que un consumidor o productor de mensajes intente obtener acceso a un destino inexistente. </P>

<P><b>Crear colas autom&aacute;ticamente</b> Especifica si el agente puede crear un destino de cola cada vez que un consumidor o productor de mensajes intente obtener acceso a un destino inexistente.</P>

<P><b>N&uacute;mero m&aacute;ximo de consumidores activos de la cola creada autom&aacute;ticamente</b> Especifica el n&uacute;mero m&aacute;ximo de consumidores que puede estar activo en una entrega de carga equilibrada desde un destino de cola.</P>
<P><b>N&uacute;mero m&aacute;ximo de consumidores de respaldo de la cola creada autom&aacute;ticamente</b> Especifica el n&uacute;mero m&aacute;ximo de consumidores de respaldo que puede ocupar el lugar de los consumidores activos en caso de que uno de estos &uacute;ltimos falle durante una entrega de carga equilibrada desde este destino. 
</P>


</BODY>
</HTML>
