<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>Propiedades del almac&eacute;n de objetos</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 <H2>Propiedades del almac&eacute;n de objetos</H2>
 
<P>Use este di&aacute;logo para agregar, eliminar o actualizar las propiedades de un almac&eacute;n de objetos que ya haya agregado al panel de navegaci&oacute;n de la consola de administraci&oacute;n.  Para editar los campos del di&aacute;logo, desconecte la consola de administraci&oacute;n del almac&eacute;n de objetos y vuelva a abrir de nuevo el di&aacute;logo.</P>

<P><b>Propiedades del servicio de nombres JNDI</b>: Use los controles de esta &aacute;rea para definir la lista de propiedades JNDI para este almac&eacute;n de objetos. Use la lista desplegable <b>Nombre</b> para seleccionar un nombre de propiedad. Despu&eacute;s de seleccionar el nombre de propiedad, use el campo <b>Valor</b> para escribir el valor de la propiedad.</P>
<P> Consulte <code>http://java.sun.com/products/jndi/1.2/javadoc/</code> para obtener informaci&oacute;n acerca de la interfaz de programaci&oacute;n de aplicaciones JNDI. Deber&aacute; definir las propiedades <code>java.naming.factory.initial y java.naming.provider.url</code>. </P>
<p>La propiedad de contexto inicial (<code>java.naming.factory.initial</code>) puede tener dos valores:</p>
<ul> 
  <li> Almac&eacute;n del sistema de archivos: <code>com.sun.jndi.fscontext.RefFSContextFactory</code></li>
  <li>Servidor LDAP: <code>com.sun.jndi.ldap.LdapCtxFactory</code></li>
</ul>
<p>Tambi&eacute;n deber&aacute; especificar la informaci&oacute;n de autenticaci&oacute;n. Sin embargo, si le preocupa la seguridad, puede esperar a que se le pida dicha informaci&oacute;n en el momento de la conexi&oacute;n.</p>
<ul>
  <li> Despu&eacute;s de especificar el nombre de propiedad y su valor, haga clic en el bot&oacute;n <b>Agregar</b> para agregar la propiedad a la tabla.</li>
  <li> Para eliminar una propiedad existente, selecci&oacute;nela en la tabla y haga clic en el bot&oacute;n <b>Eliminar</b> para eliminarla. </li>
  <li>Use el bot&oacute;n <b>Borrar</b> para borrar todas las entradas. </li>
  <li>Seleccione la propiedad que desee, cambie su valor y use el bot&oacute;n <b>Cambiar</b> para reconfigurarla. </li>
  <li>Use el bot&oacute;n <b>Aceptar</b> para confirmar todos los valores de las entradas. </li>
</ul>

<p>Para conectar de nuevo con el almac&eacute;n de objetos despu&eacute;s de reconfigurarlo: Seleccione el almac&eacute;n en el panel de navegaci&oacute;n y elija <b>Acciones &gt; Conectar con almac&eacute;n de objetos</b>. </p>

<P>&nbsp;</P>
</BODY>
</HTML>
