<!--
Copyright 2004 Sun Microsystems, Inc. All Rights Reserved
SUN PROPRIETARY/CONFIDENTIAL
Use is subject to license terms.
-->
<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
 <TITLE>visi&oacute;n general</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H1>Visi&oacute;n general</H1>
 
<P> Utilice los controles de la consola de administraci&oacute;n para comunicar con uno o varios agentes y almacenes de objetos de Message Queue.</P>
<P>La consola de administraci&oacute;n se divide en cinco paneles, como se muestra a continuaci&oacute;n.</P>
<P><img src="../images/console.gif" alt="Diagrama de la consola de administraci&oacute;n separado en cinco partes."></P>
<UL>
<LI>1 - Barra de men&uacute;s
<LI>2 - Barra de herramientas
<LI>3 - Panel de navegaci&oacute;n
<LI>4 - Panel de resultados
<LI>5 - Panel de estado
</UL>
<P>Puede utilizar los men&uacute;s de la <b>barra de men&uacute;s</b> o los iconos de la <b>barra de herramientas</b> para trabajar con los elementos seleccionados en el <b>panel de navegaci&oacute;n</b> y el <b>panel de resultados</b>.
  
  El <b>panel de estado</b> muestra informaci&oacute;n sobre la acci&oacute;n m&aacute;s recientemente efectuada.</P>
<P>El panel de navegaci&oacute;n muestra una vista de &aacute;rbol de los almacenes de objetos y agentes a los que se encuentra conectado. Los almacenes de objetos contienen objetos administrados, que pueden ser destinos (de tipo cola o tema) o f&aacute;bricas de conexi&oacute;n. Los agentes contienen una matriz de servicios y destinos f&iacute;sicos.</P>
<ul>
  <li>Para ver los destinos de un almac&eacute;n de objetos, haga clic en la carpeta Destinos. Su contenido se mostrar&aacute; en el panel de resultados.</li>
  <li>Para ver la informaci&oacute;n de las f&aacute;bricas de conexi&oacute;n de un almac&eacute;n de objetos, haga clic en la carpeta F&aacute;bricas de conexi&oacute;n. El nombre de b&uacute;squeda y el tipo de cada f&aacute;brica de conexi&oacute;n aparecen en el panel de resultados.</li>
  <li>Para ver informaci&oacute;n sobre los servicios disponibles en un agente, haga clic en la carpeta Servicios. El panel de resultados mostrar&aacute; una lista de servicios con su n&uacute;mero de puerto y estado.</li>
  <li>Para ver o modificar informaci&oacute;n sobre un servicio determinado, selecci&oacute;nelo en el panel de resultados y elija <b>Acciones &gt; Propiedades.</b></li>
  <li>Para ver informaci&oacute;n sobre los destinos f&iacute;sicos disponibles en un agente, haga clic en la carpeta Destinos. Aparecer&aacute; una lista de destinos ya creados en ese agente, junto con el tipo de destino y, para las colas de mensajes, la pol&iacute;tica de entrega. </li>
  <li>Para ver o modificar informaci&oacute;n sobre un destino determinado, selecci&oacute;nelo en el panel de resultados y elija <b>Acciones &gt; Propiedades.</b></li>
</ul>
<P>Para poder cambiar las propiedades de un almac&eacute;n de objetos o de un agente, primero es necesario desconectarse.</P>
<P>La consola de administraci&oacute;n proporciona acceso a las funciones b&aacute;sicas de administraci&oacute;n Message Queue mediante una interfaz gr&aacute;fica. Sin embargo, hay muchas m&aacute;s funciones disponibles por medio de la utilidad de comandos Message Queue correspondiente. Para obtener m&aacute;s informaci&oacute;n, consulte <i>Message Queue Administrator's Guide</i>.</P>
</BODY>
</HTML>
