<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2000-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at packager/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=UTF-8">
 <TITLE>broker dest basic</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H2>Propriedades de destino do broker &gt; <BR>B&aacute;sico</H2>
 
<P>Esta aba exibe as informa&ccedil;&otilde;es de um destino do broker. Tamb&eacute;m &eacute; poss&iacute;vel utiliz&aacute;-la para alterar as propriedades definidas para um destino utilizando a caixa de di&aacute;logo <b>Adicionar destino do broker</b>.</P>

<p><b>Nome do destino</b> Especifica o nome do destino f&iacute;sico.</p>
<p><b>Tipo do destino</b> Especifica o tipo do destino (fila ou t&oacute;pico).  </p>
<p><b>Estado do destino</b> Especifica se o destino est&aacute; ativo ou pausado (produtores pausados, consumidores pausados, ou ambos)</p>

<P>
<hr>
<p><b>N&uacute;mero atual de mensagens</b> Especifica o n&uacute;mero de mensagens n&atilde;o consumidas atualmente neste destino.</p>
<p><b>Total atual de bytes de mensagens </b> Especifica a quantidade total de mem&oacute;ria utilizada pelas mensagens n&atilde;o consumidas atualmente neste destino.</p>
<p><b>N&uacute;mero atual de produtores</b> Especifica o n&uacute;mero de produtores associados atualmente a este destino.</p>
<p><b>N&uacute;mero atual de consumidores</b> Especifica o n&uacute;mero de consumidores associados atualmente a este destino. Isso inclui ativos/inativos permanentes e n&atilde;o-permanentes (somente t&oacute;pico).</p>
<p><b>N&uacute;mero atual de consumidores ativos</b> Especifica o n&uacute;mero de consumidores ativos associados atualmente a este destino (somente fila).</p>
<p><b>N&uacute;mero atual de consumidores de backup</b> Especifica o n&uacute;mero de consumidores de backup associados atualmente a este destino (somente fila).</p>
<P>
<hr>
<p><b>N&uacute;mero m&aacute;ximo de mensagens</b> Especifica o n&uacute;mero m&aacute;ximo de mensagens n&atilde;o consumidas permitidas neste destino. </p>
<p><b>Total m&aacute;ximo de bytes de mensagens </b> Especifica a quantidade m&aacute;xima total de mem&oacute;ria permitida para mensagens n&atilde;o consumidas neste destino. Utilize a lista suspensa para selecionar a unidade de medida: bytes, kbytes ou megabytes.</p>
<p><b>M&aacute;ximo de bytes por mensagem</b> Especifica o tamanho m&aacute;ximo de uma mensagem permitido neste destino. Utilize a lista suspensa para selecionar a unidade de medida: bytes, kbytes ou megabytes.</p>
<p><b>N&uacute;mero m&aacute;ximo de produtores</b> Especifica o n&uacute;mero m&aacute;ximo de produtores permitido para este destino.</p>
<p><b>N&uacute;mero m&aacute;ximo de consumidores ativos</b> Aplica-se somente aos destinos da fila. Especifica o n&uacute;mero m&aacute;ximo de consumidores que podem estar ativos nas entregas com balanceamento de carga deste destino.</p>
<p><b>N&uacute;mero m&aacute;ximo de consumidores de backup</b> Aplica-se somente aos destinos da fila. Especifica o n&uacute;mero m&aacute;ximo de consumidores de backup que podem tomar o lugar dos consumidores ativos caso qualquer consumidor ativo falhe durante a entrega com balanceamento de carga deste destino.</p>
<P>
<hr>
<P><b>Comportamento do limite</b> Especifica como o broker responde quando o limite da mem&oacute;ria &eacute; atingido neste destino. Os valores s&atilde;o: 
<UL>
  <li>FLOW_CONTROL - diminui os produtores</li>
  <li>REMOVE_OLDEST - descarta as mensagens mais antigas</li>
  <li>REMOVE_LOW_PRIORITY - descarta as mensagens de menor prioridade de acordo com o tempo das mensagens (o cliente de produ&ccedil;&atilde;o n&atilde;o recebe nenhuma notifica&ccedil;&atilde;o da exclus&atilde;o da mensagem)</li>  
  <li>REJECT_NEWEST - rejeita novas mensagens (o cliente de produ&ccedil;&atilde;o recebe uma exce&ccedil;&atilde;o pela rejei&ccedil;&atilde;o de mensagens persistentes, mas n&atilde;o recebe nenhuma notifica&ccedil;&atilde;o de rejei&ccedil;&atilde;o das mensagens n&atilde;o persistentes)</li>
  
</ul>

<p><b>Usar fila de mensagens inativas</b> Especifica o uso de uma fila de mensagens inativas para este destino.</p>

<p>Quando uma mensagem &eacute; dada como n&atilde;o entreg&aacute;vel, ela &eacute; automaticamente colocada em uma fila especial denominada fila de mensagens inativas. A mensagem colocada nesta fila mant&eacute;m todos seus cabe&ccedil;alhos originais (incluindo seu destino original) e s&atilde;o acrescentadas informa&ccedil;&otilde;es &agrave;s propriedades da mensagem a fim de explicar por que ela se tornou uma mensagem inativa. O administrador ou desenvolvedor pode acessar esta fila, remover uma mensagem e determinar por que ela foi colocada na fila.</p>

<p>A fila de mensagens inativas &eacute; criada automaticamente pelo sistema e chamada de
<code>mq.sys.dmq</code>.</p>

<hr>

<p><b>Para limpar as mensagens de um destino:</b></p>
<ol>
  <li>Selecione o destino no painel de resultados do console.</li>
  <li>Escolha <b>A&ccedil;&otilde;es &gt; Limpar mensagens</b>.</li>
</ol>
<p><b>Para excluir um destino:</b></p>
<ol>
  <li>Selecione o destino no painel de resultados do console.</li>
  <li>Escolha <b>Editar &gt; Excluir</b>.</li>
</ol>
<p><b>Para pausar um destino:</b></p>
<ol>
  <li>Selecione o destino no painel de resultados do console.</li>
  <li>Escolha <b>A&ccedil;&otilde;es &gt; Pausar produtores | Pausar consumidores | Pausar todos</b>.</li>
</ol>
<p><b>Para reiniciar um destino pausado:</b></p>
<ol>
  <li>Selecione o destino no painel de resultados do console.</li>
  <li>Escolha <b>A&ccedil;&otilde;es &gt; Retomar</b></li>
</ol>
<p>&nbsp;</p>

</BODY>
</HTML>
