<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2000-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at packager/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<HTML>
<HEAD>
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=UTF-8">
 <TITLE>vis&atilde;o geral</TITLE>
 <LINK rel="StyleSheet" href="ide.css">
 
</HEAD>
<BODY>
 
<H1>Vis&atilde;o geral</H1>
 
<P> Utilize os controles do console de administra&ccedil;&atilde;o para se comunicar com um ou mais armazenamentos de objeto e brokers do Message Queue.</P>
<P>O console de administra&ccedil;&atilde;o est&aacute; divido em cinco pain&eacute;is, conforme mostrado abaixo.</P>
<P><img src="../images/console.gif" alt="Diagrama do console de administra&ccedil;&atilde;o dividido em cinco &aacute;reas."></P>
<UL>
<LI>1 - barra de menus
<LI>2 - barra de ferramentas
<LI>3 - painel de navega&ccedil;&atilde;o
<LI>4 - painel de resultados
<LI>5 - painel de status
</UL>
<P>Os menus da <b>barra </b> <b>de menus</b> ou os &iacute;cones da <b>barra de ferramentas</b> s&atilde;o utilizados para agir nos elementos selecionados no <b>painel de navega&ccedil;&atilde;o</b> e no <b>painel de resultados</b>. O <b>painel de status</b> exibe informa&ccedil;&otilde;es sobre a a&ccedil;&atilde;o conclu&iacute;da mais recentemente.</P>
<P>O painel de navega&ccedil;&atilde;o exibe uma visualiza&ccedil;&atilde;o em &aacute;rvore dos armazenamentos de objeto e brokers aos quais voc&ecirc; est&aacute; conectado. Os armazenamentos de objeto cont&ecirc;m objetos administrados, que podem ser destinos (fila ou t&oacute;pico) ou f&aacute;brica de conex&otilde;es. Os brokers cont&ecirc;m uma matriz de servi&ccedil;os e destinos f&iacute;sicos.</P>
<ul>
  <li>Para visualizar os destinos em um armazenamento de objeto, clique na pasta Destinos. Seu conte&uacute;do &eacute; exibido no painel de resultados.</li>
  <li>Para visualizar as informa&ccedil;&otilde;es sobre as f&aacute;bricas de conex&otilde;es em um armazenamento de objeto, clique na pasta F&aacute;bricas de conex&otilde;es. O nome de pesquisa e o tipo de cada f&aacute;brica de conex&otilde;es s&atilde;o exibidos no painel de resultados.</li>
  <li>Para visualizar informa&ccedil;&otilde;es sobre os servi&ccedil;os dispon&iacute;veis em um broker, clique na pasta Servi&ccedil;os. No painel de resultados, &eacute; exibida uma lista de servi&ccedil;os, o n&uacute;mero e o estado de cada porta do servi&ccedil;o.</li>
  <li>Para visualizar/alterar as informa&ccedil;&otilde;es sobre um determinado servi&ccedil;o, selecione o servi&ccedil;o no painel de resultados e escolha <b>A&ccedil;&otilde;es &gt; Propriedades.</b></li>
  <li>Para visualizar informa&ccedil;&otilde;es sobre os destinos f&iacute;sicos em um broker, clique na pasta Destinos. &Eacute; exibida uma lista dos destinos criados em tal broker, juntamente com o tipo do destino e, em uma fila, sua pol&iacute;tica de entrega. </li>
  <li>Para visualizar/alterar as informa&ccedil;&otilde;es sobre um determinado destino, selecione o destino no painel de resultados e escolha <b>A&ccedil;&otilde;es &gt; Propriedades.</b></li>
</ul>
<P>Para poder alterar as propriedades de um armazenamento de objeto ou de um broker, &eacute; necess&aacute;rio primeiro desconectar.</P>
<P>O console de administra&ccedil;&atilde;o proporciona acesso &agrave;s fun&ccedil;&otilde;es b&aacute;sicas de administra&ccedil;&atilde;o do Message Queue atrav&eacute;s de uma interface gr&aacute;fica. No entanto, h&aacute; muito mais fun&ccedil;&otilde;es dispon&iacute;veis utilizando os recursos de comando adequados do Message Queue. Para obter mais informa&ccedil;&otilde;es, consulte o<i> Message Queue Administrator's Guide</i>.</P>
</BODY>
</HTML>
